{
	"title": "Aviso Appoints Fortune 100 Commercial Sales Veteran Brian Young as Board Advisor and Investor And Closes Record Year",
	"slug": "aviso-appoints-fortune-100-commercial-sales-veteran-brian-young-as-board-advisor-and-investor-and-closes-record-year",
	"published": "2022/01/31",
	"description": "<p>SAN FRANCISCO, Jan. 31, 2022 PRNewswire -- Aviso AI, the only predictive Revenue Intelligence platform recognized for its whole-body Guided Selling system announced that it has appointed Fortune 100 C-Suite Executive, Brian Young, as both Board Advisor and Investor.</p><p><a href='https://www.prnewswire.com/news-releases/aviso-appoints-fortune-100-commercial-sales-veteran-brian-young-as-board-advisor-and-investor-and-closes-record-year-301471453.html?tc=eml_cleartime#'><img src='https://mma.prnewswire.com/media/1736800/Aviso_Inc_Brian_Young_Headshot.jpg?w=500' alt='Brian1'></a></p>Brian Young, Former Chief Commercial Officer, Johnson Controls<p>Brian Young was most recently the Chief Commercial Officer of Johnson Controls. As a passionate customer advocate and values based professional, he has dedicated his career to powering business strategy development and financial results at the global level – with experience working in the United States, Canada, the Netherlands and Switzerland.  Prior to joining Johnson Controls, Mr. Young held sales management and business leadership roles in North America and Europe at 3M, where he worked for 28 years.</p><p>Mr Young's appointment comes at the end of Aviso's fiscal year in which Aviso recorded 300% Y-o-Y overall growth with 600% Y-o-Y growth in its Conversational Intelligence product line and received tremendous validation with leading analysts including in the Gartner 2021 Market Guide for Revenue Intelligence and the Forrester New Tech: Revenue Operations And Intelligence, Q4 2021 report. Aviso also secured multiple competitive replacements of point solutions in conversational intelligence, forecasting, and deal and people intelligence such as Gong, Clari, People.ai, BoostUp, and InsightSquared. With global deployments at Honeywell, Armis, DataStax, AppAnnie, Ivanti, and Secure Code Warrior, Aviso also continued its expansion at current customers such as RingCentral, Elastic, and Marlin Equity Partners with its single pane of glass AI platform that works seamlessly across multiple CRM databases and Salesforce instances. </p><p>\"Aviso is taking sales effectiveness to the next level\", said Mr. Young. \"It provides unparalleled  insight into pipeline health and velocity, and combines the benefits of several competing offerings into a single platform creating a 360 degree view of customer relationships and top opportunities.  I am a huge fan. \"Aviso's latest addition to the Board Advisory team builds on its sustained commitment to enterprise AI platforms that keep sellers at the forefront of product design efforts while helping global revenue leaders leverage the power of AI augmentation and automation to empower their GTM teams. Mr Young will help Aviso build upon its 10-year vision to make AI more accessible for all companies and help every organization predict better team and business outcomes. \"Brian is one of the most visionary global revenue leaders I've come across,\" said Trevor Rodrigues-Templar, President and CEO of Aviso. \"He has had an incredible career across many industrial environments and in his most recent role at Johnson Controls, he was far ahead of his peer leaders in driving a global organizational shift to digital selling and embracing AI. I look forward to working with Brian's expertise to help more businesses worldwide unlock the collective power of their GTM teams and achieve their highest revenue and growth potential.\"</p><h4>About Aviso:</h4>Aviso is the AI-guided Compass that provides sales and go-to-market teams a single pane of glass to accelerate growth, win more deals, and find their Revenue True North. Aviso AI delivers integrated revenue intelligence for all Go-to-Market team members, drives team-wide actions and course corrections, and gives precise AI augmentation so sales teams don't get lost in the fog of CRM. With demonstrated results across Fortune 500 companies and industry leaders such as Honeywell, Seagate, Elastic, RingCentral, and Marlin Equity Partners, Aviso works at the frontier of predictive AI to maximize revenue and minimize risk.<br/></br>Aviso's AI has generated over 350 billion insights, analyzed $400B in pipeline, and helped customers win $164B in deals across customers. Companies use Aviso to drive more revenue, achieve goals faster, and win in bold, new frontiers. By using Aviso's guided-selling tools instead of conventional CRM systems, sales teams close 20% more deals with 98%+ accuracy, and reduce spending on non-core CRM licenses by 30%. Aviso is backed by Storm Ventures, Scale Venture Partners, Shasta Ventures, and leading Silicon Valley and global technology investors."
}
