{
	"title": "Aviso expands 64-hour COVID-19 Revenue Risk Assessment to help companies beat uncertainty",
	"slug": "aviso-expands-64-hour-covid-19-revenue-risk-assessment-to-help-companies-beat-uncertainty",
	"description": "REDWOOD CITY, Calif., June 19, 2020 /PRNewswire via COMTEX/ -- REDWOOD CITY, Calif., June 19, 2020 /PRNewswire/ -- According to Chief Executive Magazine, the coronavirus crisis has caused CEO confidence to plummet by 43 percent since February. As COVID-19 impacts businesses, causing waves of uncertainty as never before, spreadsheets and simple CRM tools are simply not enough to properly assess the many variables at play and make key business decisions. Aviso, the pioneer in AI-powered sales guidance and forecasting, is now expanding its 64-Hour Revenue Risk Assessment offering, after its successful deployment with a select set of customers.<br/><br/>Aviso customers such as Splunk, MongoDB, Dell, Honeywell, and Talend have continued their growth trajectory during the pandemic with new customer acquisition, versus just focusing on existing install base customers. Some Aviso customers have attained 98% to 100% forecasting accuracy - results that are especially valuable in a challenging COVID environment<br/><br/>The Aviso Revenue Risk Assessment is built on Aviso's new proprietary COVID-19 risk indicators. With this customized 100% AI-generated service and report, businesses can instantly understand the revenue impact of the pandemic, get forensics on impacted deals, pipeline risk, and \"pull-in\" deals to course-correct and grow. Aviso's machine-learning algorithms and time-series database combined with new ML models will help CFOs and CROs and sales teams accurately analyze risks, get 360 risk insights across business, and drive growth.<br/><br/>Aviso's Revenue Risk Assessment insights and recommendations includes the following:<br/><ol><li>How COVID-19 is impacting your Top 5 accounts.</li><li>AI-scored Top Deals At-Risk.</li><li>AI-scored Top Upside Deals.</li><li>AI-scored deals map across deals portfolio.</li><li>Pipeline Quality &amp; Top 10 deals closing in CQ.</li><li>Leaking Funnel &amp; Pipeline Out-of-Quarter Analysis.</li><li>Pull-in deals from future quarters to offset revenue gaps.</li></ol><br/>The 64-hour Risk Assessment is a complimentary service for qualifying businesses. These insights are automatically generated based on Aviso's AI platform in less than 3 days from connecting with a company's CRM environment (for e.g. Salesforce or Microsoft Dynamics). The analysis is applicable for B2B companies across industries and geographies.<br/><br/>\"Having once been a Fortune 500 CEO myself, I can confidently say that if I'd had Aviso when I was running businesses, it would have been my crystal ball,\" says Scott McNealy, founder of Sun Microsystems and Aviso Advisory Board Member. \"Aviso fills a void in the enterprise software ecosystem by giving businesses much-needed predictive sales guidance, not just yet another CRM tool.\"<br/><br/>\"As an operator in high-growth businesses, I've always looked for tools that drive operational excellence, mitigate risk and have the best technology,\" says Bill Heil. \"The Aviso platform is purposefully designed to drive growth, reduce operating expense, and free up sales cycles.\" Heil is former COO at WebEx, former SVP of Operations at VMware, and also an Aviso Advisory Board Member.<br/><br/>\"In these unprecedented times, companies need to make AI their compass instead of being lost in CRM. When the rate of change is high, the right time to act is now. The 64-hour Assessment can help CEOs get a pulse of risks and opportunities and guide teams to survive and thrive towards their revenue True North,\" says Trevor Rodrigues-Templar, President &amp; CEO of Aviso.<br/><br/>Organizations can learn more about Aviso's 64-hour Revenue Risk Assessment here.<br/>Learn more about Aviso's philosophy towards surviving and thriving in a Black Swan here.<br/><br/><h4>About Aviso:</h4>Aviso is the AI compass that guides sales and go-to-market teams to close more deals, accelerate growth, and find their Revenue True North. Aviso AI delivers revenue intelligence, drives informed team-wide actions and course corrections, and gives precise guidance so sellers and teams don't get lost in the fog of CRM and augment themselves with predictive AI.<br/><br/>Aviso AI has generated 305 billion insights, analyzed $180B in pipeline, and helped customers win $100B in deals. Fortune 500 companies and industry leaders such as Dell, Splunk, Honeywell, MongoDB, RingCentral, and FireEye use Aviso to drive more revenue, achieve goals faster, and win in bold, new frontiers. By using Aviso's guided-selling tools instead of conventional CRM systems, sales teams close 20% more deals with 98%+ accuracy, and reduce spending on non-core CRM licenses by 30%.<br/>Aviso is backed by Storm Ventures, Scale Venture Partners, Shasta Ventures, and other leading Silicon Valley investors.",
	"published": "2020/06/19"
}
