{
	"title": "Aviso named Strong Performer in Revenue Operations and Intelligence with highest score on Innovation Roadmap, according to Top Analysts",
	"slug": "aviso-named-strong-performer-in-the-forrester-wave-revenue-operations-and-intelligence",
	"published": "2022/03/29",
	"description": "<p>SAN FRANCISCO, Jan. 31, 2022 PRNewswire -- Aviso AI, the only predictive Revenue Intelligence platform recognized for its whole-body Guided Selling framework, has been named a Strong Performer in revenue operations and intelligence, according to the new report, “The Forrester Wave™: Revenue Operations And Intelligence, Q1 2022.” Forrester evaluated Aviso and 13 other providers across 28 criteria in its inaugural report for the category.</p><p>Aviso’s performance in Forrester’s RO&I Wave comes at the end of a record-breaking fiscal year, in which Aviso recorded 300% Y-o-Y growth with 600% Y-o-Y growth in its Conversational Intelligence product. Aviso also received strong validation in late 2021 including in the Gartner 2021 Market Guide for Revenue Intelligence and the Forrester New Tech: Revenue Operations and Intelligence, Q4 2021 report. According to Forrester, \"Aviso is an innovative revenue operations solution. In recent years, new leadership has revitalized the organization by assembling an agile and innovative development team that has quickly updated the product by executing against an aggressive roadmap. The 2022 roadmap is even more ambitious, with a focus on advanced AI capabilities as part of Aviso’s vision to be a single pane of glass for revenue operations\".</p><p>In the Forrester Wave evaluation, Aviso received the highest score possible in several criteria measured in the report, including on innovation roadmap, commercial model & pricing transparency, sales performance and productivity insights, pipeline insights, forecasting insights, and supporting products & services.</p><p>Aviso continues to drive competitive replacements as a true “single pane of glass” across conversational intelligence, forecasting, deal and activity intelligence, and GTM team collaboration, replacing Gong, Clari, People.ai, BoostUp, and InsightSquared and other point solutions. The ability of Aviso’s platform to work seamlessly across multiple CRMs (and multiple instances) such as Salesforce, Dynamics, or Hubspot, legacy databases like ERPs, Break-Fix CS, ticketing tools, and other revenue signals locked in email, calendar, meetings and chats has led to global deployments and expansions at Honeywell, Armis, DataStax, AppAnnie, Ivanti, Secure Code Warrior, RingCentral, Elastic and Marlin Equity Partners.</p><p>According to the report, “The surprising breadth of functionality provided in Aviso’s platform is a real point of difference. Forecasting capabilities support a range of use cases, including opportunity splits. Aviso provides full-lifecycle coaching management that is a step above other revenue-operations-focused providers”. The report adds, “Enterprises looking for a solution that balances comprehensive pipeline management and forecasting capabilities with increasing revenue intelligence features to support sales execution should consider Aviso.”</p><p>“Aviso enabled Ivanti with a single pane of glass for deal intelligence to fuel our continued organic and inorganic growth. What I loved about Aviso is how easy & simple it was to pull data from different CRM instances. Aviso took away heavy lifting for IT”, said Al Arun, Chief Customer Officer of Ivanti.</p><p>“The Forrester report validates my thesis that the bundling era for sales technologies is not only here, it is much needed to refocus on SaaS value exchange. Too many incumbent CRMs, CRM bolt-ons, and one trick pony AI tools have added to the bloat for sellers, CROs, CIOs, and CFOs. Only Aviso’s single pane of glass platform natively contains all the core workflows GTM teams need in an RO&I platform and that’s why the world’s leading enterprises continue to choose us.” said Trevor Templar, President & CEO of Aviso.</p><p>“Each of the current Wave leaders have large glaring holes. Those who can do simple forecasts can’t do conversational intelligence natively. Those who do CI can’t forecast or aren’t proven. Those who can’t do either are duct taping capabilities via M&A. Aviso’s innovation roadmap is unmatched and it is the only platform proven at Fortune 500 scale. Our real-time coaching, account planning, close plans, and NLP analytics will further help modern GTM teams do their revenue work in one workspace”, said Amit Pande, EVP Strategy & Growth.</p><p>To download a copy of the Forrester Wave™ report for Revenue Operations and Intelligence (RO&I), click <a href='/content/aviso-in-forrester-wave-roi-2022'>here</a>.</p><p>For more information on the Forrester Wave report methodology, click <a target='_blank' href='https://www.forrester.com/policies/forrester-wave-methodology/'>here</a>.</p></br><h4>About Aviso:</h4>Aviso is the AI-guided Revenue Operating System that provides sales and go-to-market teams a single pane of glass to accelerate growth, win more deals, and reduce risk. Aviso AI delivers integrated revenue intelligence for all Go-to-Market team members, drives team-wide actions and course corrections, and enables AI augmentation to help sales teams reduce the burden of CRM. With demonstrated results across Fortune 500 companies and industry leaders such as Honeywell, NetApp, Seagate, Elastic, Armis, Ivanti, RingCentral, and Marlin Equity Partners, Aviso works at the frontier of AI applications across deep learning, speech recognition, decision management, and computer vision.<br/></br>Aviso's AI has generated over 350 billion insights, analyzed $400B in pipeline, and helped customers win $164B in deals across customers. By using Aviso, sales teams close 20% more deals with 98%+ accuracy, and can reduce CRM cost burden by up to 30%. Aviso is backed by Storm Ventures, Scale Venture Partners, Shasta Ventures, and leading Silicon Valley and global technology investors."
}
