{
	"title": "Aviso features in leading analyst guides for Revenue Intelligence and adds 3 new expert Board advisors",
	"slug": "aviso-features-in-leading-analyst-guides-for-revenue-intelligence-and-adds-3-new-expert-board-advisors/",
	"description": "SAN FRANCISCO, Dec. 10, 2021 /PRNewswire/ -- Aviso AI, the only predictive Revenue Intelligence platform recognized for its whole-body Guided Selling system since 2019 disclosed that it has been recognized by the 2 leading analysts in their first ever market category reports for Revenue Intelligence. Aviso was listed as a representative Vendor in Gartner's \"2021 Market Guide for Revenue Intelligence\" and Forrester's \"New Tech: Revenue Operations &amp; Intelligence Q4 2021\" report. Aviso also announced the addition of 3 key expert Advisors: Brooke Wenig, Head of Machine Learning at DataBricks, Jake Tatel, Global Sales Productivity Leader at Intel, and Rob Hines, Chief Revenue Officer at Block.one.<br/><br/>The market reports show customer demand and sophistication in buying revenue intelligence technologies is increasing rapidly, including to account for the rise of virtual selling since the pandemic started. Since first predicting in 2020 that 50% of organizations would use AI Guided Selling technologies, Gartner has subsequently updated its projections, stating that by 2025, 75% of B2B sales organizations will replace traditional sales playbooks with AI-based guided selling solutions.<br/><br/>Aviso AI listed as representative Vendor in Gartner, Forrester Revenue Intelligence market guides and adds new advisors<br/><br/>Aviso's patented Guided Revenue Intelligence platform acts as a \"single pane of glass\" for revenue teams to predict forecasts with over 98%+ accuracy across multiple CRMs and CRM instances, provide advanced sentiment, intent, and aspect based conversational intelligence, persona-based next best actions, and embedded collaboration, all while eliminating CRM data entry and reducing CRM costs by 30%. Aviso's time-series database is the only one of its kind in the industry, and it brings the data, workflows, insights, and actions GTM teams need to win.<br/><br/>Customers such as Honeywell, RingCentral, FireEye, LaunchDarkly, DataStax and Marlin Equity Partners use Aviso to drive 25% higher win rates, 50% faster sales cycles, over $100MM in incremental revenue for the typical Fortune 500 company, offering a 500%+ Return on Investment. \"If I had Aviso when I was a CEO of Fortune 500 companies, it would have been my crystal ball\", said Scott McNealy, Aviso Advisor and former CEO of Sun Microsystems.\"<br/><br/>Brooke Wenig is a Machine Learning Practice Lead at Databricks. She leads a team of data scientists who develop large-scale machine learning pipelines for customers, as well as teach courses on distributed machine learning best practices. She is a co-author of Learning Spark, 2nd Edition, co-instructor of the Distributed Computing with Spark SQL Coursera course, and co-host of the Data Brew podcast.<br/><br/>Jake Tatel is a 28-year Intel leader for Global Sales Enablement and Productivity. Jake is a strategic marketing and sales leader who has led several transformations at Intel including GM for Online Sales, and as Global Director of Inside Sales and Marketing Automation. Jake is passionate about applying technology to transform the Go-to-Market function, and has been featured in interviews and panels with VentureBeat, AA-ISP, Gartner, Forrester, and with leading podcasts.<br/><br/>Rob Hines is the Chief Revenue Officer of Block.one, a high-performance Blockchain Solutions leader. Rob has more than 20 years of experience in the technology industry, including a number of executive roles marketing and selling SaaS-based business applications, enterprise security and data center solutions. Hines has served as Regional Vice President at Salesforce.com. He also has held sales leadership and management positions at Symantec, Amdocs and Sun Microsystems.<br/><br/>\"I'm delighted that Brooke, Jake, and Rob have joined us as Advisors\" said Trevor Rodrigues-Templar, President and CEO of Aviso. \"Customers, analysts, and users continue to validate our whole-body revenue intelligence approach as we replace expensive point solutions in Fortune 500 and high growth companies. As the only AI-guided revenue intelligence platform, we are at the frontier of applying machine learning and advanced analytics and technologies to the Go-to-Market function. I look forward to working with Brooke, Jake, Rob, and the rest of our global advisory board to help businesses unlock the collective power of their Sales and Go-to-market teams and achieve their highest revenue and growth potential.\"<br/><br/>Aviso's latest additions to the Board Advisory team builds on its sustained commitment to enterprise AI platforms that are inclusive of traditional, digital, and hybrid selling models at scale to businesses worldwide across any industry while leveraging the power of AI augmentation and automation to empower revenue teams.<br/><br/><br/>Gartner Disclaimer<br/><br/>Gartner does not endorse any vendor, product or service depicted in its research publications, and does not advise technology users to select only those vendors with the highest ratings or other designation. Gartner research publications consist of the opinions of Gartner's research organization and should not be construed as statements of fact. Gartner disclaims all warranties, expressed or implied, with respect to this research, including any warranties of merchantability or fitness for a particular purpose.<br/><br/><h4>About Aviso:</h4><br/>Aviso is the AI-guided Compass that provides sales and go-to-market teams a single pane of glass to accelerate growth, win more deals, and find their Revenue True North. Aviso AI delivers integrated revenue intelligence for all Go-to-Market team members, drives team-wide actions and course corrections, and gives precise AI augmentation so sales teams don't get lost in the fog of CRM. With demonstrated results across Fortune 500 companies and industry leaders such as Honeywell, Seagate, Elastic, RingCentral, and Marlin Equity Partners, Aviso works at the frontier of predictive AI to maximize revenue and minimize risk.<br/><br/>Aviso's AI has generated over 350 billion insights, analyzed $400B in pipeline, and helped customers win $164B in deals across customers. Companies use Aviso to drive more revenue, achieve goals faster, and win in bold, new frontiers. By using Aviso's guided-selling tools instead of conventional CRM systems, sales teams close 20% more deals with 98%+ accuracy, and reduce spending on non-core CRM licenses by 30%. Aviso is backed by Storm Ventures, Scale Venture Partners, Shasta Ventures, and leading Silicon Valley and global technology investors.",
	"published": "2021/12/12"
}
