{
	"title": "Aviso Wins The 2016 Global Sales Forecast Optimization Customer Value Excellence through Application Convergence Award",
	"description": "<strong>Menlo Park, Calif., March 22, 2016</strong> – Aviso (www.aviso.com) the leader in predictive insights for sales management, operations, and forecasting, was awarded the Frost &amp; Sullivan Global Sales Forecast Optimization Customer Value Excellence through Application Convergence Award. This award recognizes Aviso as an industry leader in the sales forecasting and predictive analytics market. The Frost &amp; Sullivan award is given to a company that is with breakthrough technologies and operating at a best-in-class level. Frost &amp; Sullivan evaluated two key factors— Application Convergence Impact and Customer Impact. Aviso rated number one in both categories for 2016.<br/><br/>Aviso delivers predictable revenue growth by providing sales leaders with actionable pipeline insights. With Aviso, you get a real-time, unbiased forecast showing you the right deals to focus on, what’s changed in your pipeline, early warnings and game-changing insights on how to get the plan back on track.<br/><br/>“It’s a privilege to receive this award from Frost &amp; Sullivan. This award solidifies Aviso’s place in the market, and the need for best-in-class sales forecast and pipeline analytics tools. Aviso’s customers are our biggest advocates, which is a testament to the value we provide their sales leaders on an ongoing basis,” says K.V. Rao, co-founder and CEO of Aviso.<br/><br/>\"Aviso makes a clear case against spreadsheet-based business intelligence solutions with its impressive ability to deliver a real-time, actionable forecast, allowing sales leaders to meet and exceed targets on a consistent basis. Hence, Aviso was the clear winner of this award, scoring high marks on our Decision Support Scorecard,\" says Arjav Mehta from Frost &amp; Sullivan.<br/><br/>Aviso enables sales leaders to consistently make plan by forecasting easily and accurately, focusing on the deals that matter, and using actionable insights to make course corrections throughout the quarter.<br/><ul><li>Sales Performance: Coach reps to success by focusing on the right deals through dynamic opportunity scoring</li><li>Target Attainment: Stay on track to hit your plan with early warning indicators and actionable insights</li><li>Forecasting Effectiveness: Lead more productive forecast calls with a real-time forecast that provides unprecedented visibility into your pipeline</li></ul><br/>You can learn more about how Aviso is turning every sales team into SuperForecasters and delivering predictable revenue growth by visiting aviso.com.<br/><br/><h4>About Aviso</h4>Aviso provides the leading predictive insights software designed to help sales teams optimize their performance and exceed their revenue goals. Aviso transforms and automates tedious sales forecasting processes with an easy-to-use, secure cloud application using a unique combination of machine learning algorithms and portfolio management techniques. Aviso Insights delivers a powerful data-driven decision-making framework to prioritize deals, deploy resources, and mitigate risks, driving revenue growth for small and large enterprises. Funded by leading venture capital firms Scale Ventures, Next World Capital, Shasta Ventures, First Round Capital, Cowboy Ventures, and Bloomberg Beta, Aviso’s customers include Splunk, HubSpot, RingCentral, Saba, and Replicon. For more information, visit www.aviso.com and follow us @AvisoInc.<br/><br/><h4>About Frost &amp; Sullivan</h4>Frost &amp; Sullivan, the Growth Partnership Company, works in collaboration with clients to leverage visionary innovation that addresses the global challenges and related growth opportunities that will make or break today's market participants.",
	"slug": "aviso-wins-the-2016-global-sales-forecast-optimization-customer-value-excellence-through-application-convergence-award/",
	"published": "2016/03/22"
}
