{
	"title": "Aviso launches industry’s 1st revenue intelligence Value Calculator for AI Sales benefit and cost assessments",
	"slug": "aviso-launches-revenue-intelligence-value-calculator",
	"description": "SAN FRANCISCO, Dec. 14, 2021 PRNewswire -- Aviso AI, the only predictive Revenue Intelligence platform recognized for its whole-body Guided Selling system since 2019 has launched the industry's first revenue intelligence focused Value Estimation Calculator for AI sales platforms to help every company demand more value from their Sales AI investments. The Value Calculator is a self-serve, free-to-use tool to help Commercial Sales leaders and CROs, as well as Enablement and Productivity leaders quantify the value of an integrated revenue intelligence approach to their business.<br/></br>According to BetterCloud's State of SaaSOps report, the average organization is using 110 SaaS apps this year up from an average of 80 last year and SaaS spend and visibility is a top challenge for CIOs and business leaders. Forty-two percent of respondents said finding unused or underutilized SaaS app licenses was one of their most crucial challenges to solve and 80% of respondents concede that some percentage of their SaaS spend is being wasted.<br/></br>For most organizations, analyzing the Return on Investment (ROI) of an integrated AI revenue intelligence approach requires tremendous manpower and often relies on guesswork and unreliable spreadsheets. Aviso's Value Estimation Calculator is a comprehensive streamlined design and easy-to-use solution for teams of any size to do scenario modeling on how a single pane of glass approach like Aviso AI can provide both revenue and cost benefits, by integrating GTM collaboration, predictive forecasting, activity management, conversational intelligence, relationship intelligence, CRM automation, and sales analytics.<br/></br>Customer demand and sophistication in buying revenue intelligence technologies is increasing rapidly, including to account for the rise of virtual selling since the pandemic started. Aviso has launched this new calculator to help all businesses demand more from their Sales AI tools.<br/></br>\"Aviso's Value Estimation Calculator is a game-changer for CROs and CIOs. In 2021, revenue intelligence has emerged as a C-suite initiative\", said Trevor Rodrigues-Templar, President and CEO of Aviso. \"Across our customer base, we have seen how challenging it is for non-Finance practitioners to see ROI from AI investments so we decided to build this asset for the revenue operations community. With the Aviso Value Calculator, any revenue team can build scenarios for their unique sales environment, and generate custom reports with specific metrics to show their leadership the value of AI investments like Aviso for the Revenue Operations function.\"Aviso's patented Guided Revenue Intelligence platform acts as a \"single pane of glass\" for revenue teams to predict forecasts with over 98%+ accuracy across multiple CRMs and CRM instances, provide advanced sentiment, intent, and aspect based conversational intelligence, persona-based next best actions, and embedded collaboration, all while eliminating CRM data entry and reducing CRM costs by 30%. Aviso's time-series database is the only one of its kind in the industry, and it brings the data, workflows, insights, and actions GTM teams need to win.<br/></br>\"Revenue Operations leaders have for long been looking for a way to justify the right predictive AI investments for their function. As a revenue ops leader at ServiceNow and VMWare earlier in my career, I long sought tools that could help me do the same\", said Harish Dittakavi, EVP Operations at Aviso. \"But before leaders can invest in the right technology and not get burnt with AI that over-promises and under-delivers, they need education on best practices and variables including on conversion metrics, upsell and cross-sell potential, and operational costs. With Aviso's Value Estimation Calculator, execs, managers, and users can simulate their sales environment and scenarios and receive a trusted quantitative assessment. Working with our Value Selling team, they have the option to refine the free assessment into a customized business case that drives the full value of revenue intelligence for their organization.\"Customers such as Honeywell, RingCentral, FireEye, LaunchDarkly, DataStax and Marlin Equity Partners use Aviso to drive 25% higher win rates, 50% faster sales cycles, over $100MM in incremental revenue for the typical Fortune 500 company, offering a 500%+ Return on Investment. Aviso's Value Estimation Calculator was developed in partnership with the world's leading companies and their revenue leaders, leveraging the best practices and observing limitations in unreliable ROI tools.<br/></br>Gartner predicts 75% of the Highest Growth Companies in the World Will Deploy a RevOps Model by 2025. \"CEOs and chief sales officers recognize that functional silos handing off clients from one function to the other, and using different technologies, people and processes, are a barrier to revenue growth,\" said Doug Bushée, Senior Director Analyst at Gartner. \"As a result, progressive organizations are beginning to align sales, marketing and customer success technology, data and KPIs to provide an end to end view of the revenue-generating engine.\"<br/></br>Aviso AI's Value Estimation Calculator is free and available to use at <a class='uk-link' href=\"/valuecalculator/\">https://www.aviso.com/valuecalculator/</a><br/></br><h4>About Aviso:</h4></br>Aviso is the AI-guided Compass that provides sales and go-to-market teams a single pane of glass to accelerate growth, win more deals, and find their Revenue True North. Aviso AI delivers integrated revenue intelligence for all Go-to-Market team members, drives team-wide actions and course corrections, and gives precise AI augmentation so sales teams don't get lost in the fog of CRM. With demonstrated results across Fortune 500 companies and industry leaders such as Honeywell, Seagate, Elastic, RingCentral, and Marlin Equity Partners, Aviso works at the frontier of predictive AI to maximize revenue and minimize risk.<br/></br>Aviso's AI has generated over 350 billion insights, analyzed $400B in pipeline, and helped customers win $164B in deals across customers. Companies use Aviso to drive more revenue, achieve goals faster, and win in bold, new frontiers. By using Aviso's guided-selling tools instead of conventional CRM systems, sales teams close 20% more deals with 98%+ accuracy, and reduce spending on non-core CRM licenses by 30%. Aviso is backed by Storm Ventures, Scale Venture Partners, Shasta Ventures, and leading Silicon Valley and global technology investors.",
	"published": "2021/12/15"
}
