{
	"title": "Based on the Popularity of its Sales Forecasting and Insights Platform, Aviso Expands Funding by $8M to Scale the Business",
	"description": "<strong>MENLO PARK, CA - February 17, 2017</strong> -- <a href=\"https://www.aviso.com/\">Aviso</a>, the SaaS company enabling technology companies to accelerate sales growth through artificial intelligence, today announced that it has added $8 million in funding to continue accelerating the success of its Sales Forecasting and Insights Platform. As the company aggressively scales to meet demand, Aviso also announced that Michael Lock, cloud business software veteran, has joined the company as its new Chief Executive Officer (CEO).<br/><br/>“Aviso has done an outstanding job of enabling sales executives to forecast confidently, plan for the future, and close more deals with artificial intelligence insights. Given my previous role as a CRO, a key user of the Aviso product, this role was especially exciting, and something I couldn't pass up. I look forward to driving even wider adoption of this ground-breaking technology.”<br/><br/>Lock is a recognized thought leader in the world of business cloud. He brings extensive experience commercializing cloud software as well as managing fast-action sales and marketing teams in the industry. Lock was a founding executive at Google Enterprise (Cloud) and helped grow the business from its infancy to $1 billion. He was also instrumental in launching Google Apps, including business versions over Gmail, Google Calendar, Google Docs, Google Drive as well as Google Maps and Google Cloud Platform. Most recently, Lock served as COO and president of venture-backed Hearsay Social where he partnered with the founders to quadruple their recurring revenue.<br/><br/>Lock joins Aviso as it continues to rapidly grow a customer base that serves both rising stars and established leaders in technology, including Apttus, Hubspot, Nutanix, Pandora, Ring Central, Splunk, and Xactly. These companies have relied upon Aviso to navigate critical stages of growth both pre- and post-IPO when sales predictability and process discipline are critical. The Aviso platform has enabled data-driven, accurate forecasting, and empowered sales teams with unprecedented business visibility and insights to close deals faster.<br/><br/>To assist Lock and the talented Aviso team as the company continues its upward trajectory, Aviso has received additional funding from its core investors including Scale Venture Partners, Next World Capital, and Shasta Ventures, each of which has deep experience with cloud software companies. <br/> <br/>\"Aviso is the category-defining leader when it comes to sales forecasting and delivering actionable, machine learning insights,” said Stacey Bishop of Scale Venture Partners. “The additional funding is a solid vote of confidence in Michael and the executive team as they execute on the huge opportunity in front of them.” <br/><br/><h4>About Aviso</h4>Aviso is the leading provider of sales forecasting and machine learning insights. Sales teams from HubSpot, Nutanix, RingCentral, Splunk, Pandora and Apttus, use Aviso to accelerate sales growth through artificial intelligence. Aviso’s cloud-based Sales Forecasting and Insights Platform drives forecast accuracy and enables executive planning with an accurate forecast on Day 1 of the quarter. Managers provide data-driven coaching sessions and sales teams close deals faster with insights powered by best-in-class machine learning algorithms. Aviso is headquartered in Menlo Park, CA. For additional information, visit us aviso.com. <br/><br/><b>Contact Aviso</b><br/>Marisa Lam<br/>GMK Communications for Aviso<br/><a href=\"mailto:marisa@gmkcommunications.com\">marisa@gmkcommunications.com</a><br/>650.544.3350",
	"slug": "based-on-the-popularity-of-its-sales-forecasting-and-insights-platform-aviso-expands-funding-by-8m-to-scale-the-business/",
	"published": "2017/02/17"
}
