{
	"title": "Fall ‘17 Release of Aviso Sales Vision Platform Set to Revolutionize Pipeline and Deal Reviews",
	"description": "<h4>Aviso Aligns Three Critical Sales Processes on One Platform to Drive Forecast Accuracy, Smarter Pipeline Reviews and More Closed Deals</h4><br/><strong>Menlo Park, Calif. -- October 26, 2017 --</strong> Aviso today announced the latest release of Aviso <a href=\"https://www.aviso.com/\">Sales Vision</a>, the leading AI-powered platform purpose-built to drive forecast accuracy and sales visibility. With this latest release, Aviso is set to revolutionize the way sales leaders conduct pipeline reviews, make deal reviews smarter and more actionable, and continue to drive forecast accuracy.<br/><br/>Aviso is the category-defining provider of forecasting technology and AI assistance in the form of unbiased machine learning recommendations to help reps improve their forecast accuracy, from correctly calling deal amounts, and close dates, to increasing the percentage of correctly committed deals.<br/><br/>With Aviso, sales and sales operations teams leverage Aviso’s unique set of predictions to see how their quarter is set to unfold, determine what’s standing in the way of hitting their goal, and where they should focus their efforts to proactively impact quarterly results. Only Aviso provides forecast and pipeline views by rep, region, product line, or any other business pivot, with drill down capability into deal-level detail, so that sales and sales operations leaders know exactly what levers to push to positively affect the outcome.<br/><br/><strong>Three Critical Sales Processes, One Powerful Platform  </strong><br/><br/>Known for its world-class forecast rollup, Aviso has added new functionality that now aligns sales forecasting, pipeline reviews, and deal reviews on a single, collaborative tool. With all three critical sales processes on one platform, Aviso offers unprecedented, 360-degree visibility across the entire sales lifecycle.<br/>Among other major enhancements, Aviso’s latest platform improvements include:<br/><ul><li><strong>Laser-Focused Pipeline Reviews:</strong> With the release of its new Pipeline Change Insights feature, Aviso is disrupting the traditional “top-down” method often used by sales teams. With Aviso, managers and reps no longer unscientifically plod their way down through the biggest deals in “commit” and “best case,” wasting time looking at the wrong deals, while overlooking deals that need immediate attention. Sales teams can now eliminate spreadsheets and confusing sankey graphs used to show change analytics, in favor of a data-driven report showing the most important week-over-week deal changes. Aviso’s secret sauce lies in its three magic buttons and special smart filter which make following deals through the pipeline simple and intuitive. Reps and managers can focus on the deals that need attention and free up time to sell more.</li><li><strong>Zero-Prep Deal Reviews:</strong> It can take sales reps hours to pull together data in preparation for the dreaded weekly deal review meeting with managers. Aviso puts real-time data at reps’ fingertips and eliminates the need for data prep. The new Deal Review Module uniquely presents all deal-relevant data in one collaborative tool, and combines it with deal-closing insights, making deal reviews smarter and more actionable. Reps and managers leverage CRM data, full history of the deal lifecycle, org charts, email and calendar activity, among other data. With full deal context, and warnings based on historical performance, reps stay on track and close more deals.</li></ul><br/>“As our sales organization has grown in size and complexity, collecting, analyzing and tracking sales forecasts has become more challenging. We outgrew spreadsheets so we evaluated several commercial offerings and concluded that Aviso has the robustness and flexibility that we need,\" said Carlos Delatorre, CRO, MongoDB. “Aviso allows us to analyze sales leader’s forecasts at multiple levels in the organization and to contrast them with the underlying deals. Ultimately, the result is a more accurate, reliable roll-up and richer, more actionable forecast conversations. So far the implementation and adoption have been excellent.”<br/><br/>\"The new pipeline and deal review innovations Aviso is releasing will redefine the way sales teams manage these critical revenue generating processes. I have yet to see functionality this innovative in either of these two areas. I expect this will disrupt the market,\" said Nancy Nardin, founder of Smart Selling Tools and a nationally recognized thought leader on sales productivity tools.<br/><br/>“Aviso provides the #1 forecasting and sales visibility platform on the market, and our latest advancements make it even easier for sales leaders to streamline two critical sales processes,” said Michael Lock, CEO of Aviso. “Forecast Management, Pipeline Reviews and Deal Reviews are the cornerstone processes of building a world-class sales organization. We’ve united these three critical processes in one tool, offering true visibility and adding a smart layer to help sales teams become more data-driven.”<br/><br/>Watch our <a href=\"http://info.aviso.com/revolutionize-pipeline-deal-reviews-new-fall-release-webinar-regpg\">video</a> to learn more from our CEO about the Fall 2017 Product Release.<br/><br/><strong>Pricing and Availability: </strong>The newest enhancements to Aviso Sales Vision will be available in Q4 2017. If you are ready to forecast accurately, conduct smarter pipeline reviews, and close more deals, we invite you to book a <a href=\"http://info.aviso.com/accelerate-sales-growth-teanne-sparaco\">demo</a>.<br/><strong>About Aviso</strong><br/><br/>Aviso offers the only product on the market purpose-built for forecasting and sales visibility. The Aviso Sales Vision platform aligns sales forecasting, pipeline reviews, and deal reviews on one, collaborative tool. With key sales data from three critical processes all in one place, Aviso provides unprecedented, 360-degree visibility across the entire sales lifecycle, from call number, to closed deal. With Aviso technology and a powerful AI smart layer powering our platform, sales and sales operations teams at companies such as Apttus, Splunk and Xactly improve forecast accuracy, make smart selling decisions to close more deals, and leverage insights to maximize impact. With Aviso, you’ll not only know if a rep, product line or business segment is forecasted to miss the number, but by how much, and what to do about it. Aviso is headquartered in Menlo Park, CA. For additional information, visit us at <a href=\"https://www.aviso.com/\">www.aviso.com</a>, <a href=\"https://twitter.com/avisoinc?lang=en\">Twitter</a>, or <a href=\"https://www.linkedin.com/company/aviso-inc/\">LinkedIn</a>.<br/><br/>Contact:<br/>Heather Ryan<br/><a href=\"mailto:heather.ryan@aviso.com\">heather.ryan@aviso.com</a>",
	"slug": "fall-17-release-of-aviso-sales-vision-platform-set-to-revolutionize-pipeline-and-deal-reviews/",
	"published": "2017/10/26"
}
