{
	"title": "Microsoft  Executive Ron Huddleston Joins Aviso, Inc’s  Board of Directors",
	"description": "<strong>Menlo Park, Calif., May 18, 2016 </strong>-<strong> </strong>Aviso, Inc, the leader in predictive insights for sales management, operations, and forecasting announced today that Ron Huddleston, corporate vice president at Microsoft, has been appointed to the company’s board of directors. Huddleston joins existing board members Jason Pressman of Shasta Ventures, Craig Hanson of Nextworld Capital, and Stacey Bishop with Scale Ventures.<br/><br/>“I am excited to have Ron Huddleston join our board and help guide the company through this next phase of growth,” said K. V. Rao, Founder and CEO of Aviso, Inc. “Ron brings an incredible understanding of the CRM space with executive experience at Salesforce.com and Oracle, and now at Microsoft. In particular, his experience and focus on building and developing world class enterprise cloud businesses is invaluable, as we overlay our predictive insights on top of core CRM to drive faster revenue growth for our customers.”<br/><br/>“The timing is perfect for adding powerful machine learning and statistical frameworks to CRM data to assist sales teams in their quarterly quest to realize the upside,” said Ron Huddleston, corporate vice president at Microsoft. “I am honored to join the Aviso board and look forward to working with the executive team to address this opportunity and advance the future of sales.”<br/><br/>Ron Huddleston is a corporate vice president of enterprise partner ecosystem at Microsoft. Prior to joining Microsoft, Ron was the Senior Vice President of Global ISV &amp; Channels at salesforce.com and is credited with developing the world’s largest Enterprise Cloud marketplace and ecosystem, the AppExchange. Earlier, he was a vice president of ISV and OEM sales at Oracle. In these positions, he has successfully lead the creation, rollout, and ongoing success of new and innovative partner businesses for the largest enterprise software companies in the world. Ron is known and well-respected for delivering stellar business results, cultivating strong partnerships and world class teams, and developing the first and best cloud partner ecosystem in the world. He brings this same energy, excitement and experience to Aviso as its independent board member. <br/><br/><h4>About Aviso, Inc</h4>Aviso provides the leading predictive insights software designed to help sales teams optimize their performance and exceed their revenue goals. Aviso transforms and automates tedious sales forecasting processes with an easy-to-use, secure cloud application using a unique combination of machine learning algorithms and portfolio management techniques. Aviso Insights delivers a powerful data-driven decision-making framework to prioritize deals, deploy resources, and mitigate risks, driving revenue growth for small and large enterprises. Funded by leading venture capital firms Scale Ventures, Next World Capital, Shasta Ventures, First Round Capital, Cowboy Ventures, and Bloomberg Beta, Aviso’s customers include Splunk, HubSpot, RingCentral, Nutanix, and Marketo. For more information, visit <a href=\"https://www.aviso.com\" target=\"_blank\" rel=\"noopener\">www.aviso.com</a> and follow us <a href=\"http://www.twitter.com/avisoinc\" target=\"_blank\" rel=\"noopener\">@AvisoInc</a>.",
	"slug": "microsoft-executive-ron-huddleston-joins-aviso-incs-board-of-directors/",
	"published": "2016/05/18"
}
