{
	"title": "5 blind spots in your CRM",
	"image": "https://assets.uiaas.io/web/aviso/blog/Optimized-backlit-clouds-dawn-1118874-300x168.webp",
	"content": "<i>“My CRM is a sparkling picture of absolute truth”</i> —said no one, ever. Except Dr. Seuss.\n\nWe all know CRM tells an incomplete story about the state of your business. We know that data isn’t always formatted properly, or that the fields don’t match our business perfectly.\n\nBut <i>just how wrong</i> is your CRM data? How do these inaccuracies, in sum, impact your mission-critical sales forecast? How much could your CRM data—and lack of organized metadata—be messing with your revenue?\n\nOur AI team has identified 5 common data blind spots in CRM. Understanding them could be key to delivering a more accurate forecast and closing more pipeline.\n\n<b>Blind Spot I: Inactive Owners can still sell things</b>\n\nRemember when Jane left last week to start a company? Jane is now an “Inactive Owner,” meaning she’s been scrubbed from your CRM, but there are still open opportunities tied to her former accounts. These opportunities aren’t any less likely to close just because their owner has left, and yet because they have an “inactive owner,” they can no longer show up on the sales forecast. This is a counter-intuitive example of CRM data being “dirty,” simply due to the structural reality that the minute an active owner is toggled to “inactive,” the footprint of their pipeline is essentially gone too and should be immediately reassigned.\n\n<b>Blind Spot II: Won Deals don't always stay Won</b>\n\nThe champagne has been popped and everyone’s celebrating a major deal that just closed. But is this deal… for real? Turns out, 97% yes, and 3% no. When we analyzed this factor across all our clients, the “win rate” of won deals turned out to be ~97%. That means 3% of “won deals” become “un-won”—maybe they fall apart in legal, maybe the “win” was prematurely entered. Who knows!? But the reality is that your revenue forecast probably counts a won deal as revenue on the books. Once again your CRM data has failed you.\n\n<b>Blind Spot III: Backdating Happens</b>\n\nEveryone backdates. It’s not like CRMs are real-time 24/7 monitoring systems that auto-update based on our every thought and action. But all this backdating (entering in data retroactively, sometimes weeks or months later) has an impact on how truthful your CRM can really be. Knowing the conditions, triggers and cycles of backdating that will inevitably occur in your sales org, much like knowing the weather, will help you make a more accurate revenue forecast than if you acted like backdating doesn’t exist. It turns out that the metadata associated with backdating is possible to model and predict— with AI.\n\n<b>Blind Spot IV: Listed Amount vs. Final Amount </b>\n\nHaving certainty around listed vs. final price is usually nice, but this isn’t the case in listed deals vs. final deals. Typically final closing amounts for the average deal vary quite a lot from the listed value during the sales process. And unfortunately, the Final Amount is usually less than what was projected. Final deal amounts can also go up, but in general, your CRM data is going to overshoot the total amount your deals will actually close for. The exact degree of inflation is anyone’s guess—unless you have an AI tool like Aviso to predict (with at least 90% accuracy) the final amount of every deal in your pipeline.\n\n<b>Blind Spot V: Listed Close Date? Simply Add 2 Weeks with Water.</b>\n\nReps overestimate how quickly they can close a deal by approximately 2 weeks. To make matters worse, most reps rarely underestimate. This optimism is especially dangerous when close dates are early or mid-quarter. Time-inflation can functionally cause a domino effect, pushing the actual close date of numerous deals later and later (even into the next quarter), which is disastrous for the forecast and revenue targets. Having a tool that forecasts actual close dates with 90% accuracy is your defense against this blind spot.\n\nAviso exists to illuminate every dark corner of CRM data and metadata with the power of AI, and turn that hidden information into actionable insights that raise sales revenues.\n<blockquote>Your CRM data may be horrendous, but with the power of Artificial Intelligence, your sales forecasts and revenue results don’t have to be.</blockquote>",
	"slug": "5-blind-spots-in-your-crm",
	"author": "Matthew Menard",
	"categories": [
		"AI for Sales",
		" Data Science",
		" Sales Analytics",
		" Sales Forecasting"
	],
	"pub_date": "2/19/19",
	"pub_time": "5:12 PM",
	"description": "Aviso 5 blind spots in your CRM. AI-powered forecasts, deal accelerating insights, and 360-degree visibility into forecast data."
}
