{
	"title": "A New Aviso: The Philosophy Behind Our UI/UX Refresh",
	"image": "https://assets.uiaas.io/web/aviso/blog/Blog_Header-300x150.webp",
	"content": "This week, Aviso AI’s new and improved user interface will be released to all of our customers. The past year was an exciting one for Aviso, after Trevor Templar <a href=\"https://www.aviso.com/blog/why-i-joined-aviso-as-ceo/\">joined as CEO</a>. we embarked on a multi-pronged journey to make core changes to our product that reflect the advancements our company has made in our technology.\n\nIf you’ve been following our blog you know that our product and engineering teams have been hard at work expanding Aviso AI’s value to users beyond just forecast rollups and deal management. Our AI is now full steam ahead towards a system of AI guidance for all parts of the sales process that we know our users will find essential to their workflow.\n\nTo mirror this exciting path of our feature set, it was only natural to evolve our product’s look and feel. The design team’s goal was to provide an aesthetic brand refresh to the User Interface (UI) and improve usability of key features for a better User Experience (UX.)\n\n<img class=\"aligncenter wp-image-8385 size-full\" src=\"https://assets.uiaas.io/web/aviso/blog/logo-update-colors.webp\" alt=\"\" width=\"1421\" height=\"869\" />\n\nTo make this happen, the design team at Aviso spent countless hours:\n<ul>\n \t<li>Analyzing every detail and workflow of our product for usability.</li>\n \t<li>Interpreting feedback from customers.</li>\n \t<li>Researching modern trends and the most current usability patterns.</li>\n \t<li>Iterating on product improvements with great care to balance our new innovations with key functionality our users love from us.</li>\n</ul>\n<img class=\"size-full wp-image-8374 aligncenter\" src=\"https://assets.uiaas.io/web/aviso/blog/brainstorm_AkhilJesse.webp\" alt=\"\" width=\"1800\" height=\"1013\" />\n\nBorn from these efforts is a refresh of Aviso AI’s platform with what we have dubbed the <strong>Lighthouse User Interface.</strong> We’re excited to share these improvements to our AI compass with you.\n\n<img class=\"wp-image-8383 aligncenter\" src=\"https://assets.uiaas.io/web/aviso/blog/new-ui-hero_shot@2x-577x300.webp\" alt=\"\" width=\"704\" height=\"366\" />\n\n&nbsp;\n\nHere are the improvements you will experience:\n<ul>\n \t<li>A color palette that utilizes color to guide your eyes to important pieces of data.</li>\n \t<li>A more legible and prominent font set.</li>\n \t<li>Usability improvements that are more intuitive.</li>\n \t<li>Streamlined navigation between and within pages for faster workflows.</li>\n</ul>\n<img class=\"size-full wp-image-8378 aligncenter\" src=\"https://assets.uiaas.io/web/aviso/blog/Color-Font_updates.webp\" alt=\"\" width=\"1713\" height=\"435\" />\n\nBecause our product runs on cutting edge AI under the hood, we want our users to be able to get a strong sense of those powerful mechanics while experiencing Aviso on the exterior. An example of this is our application of the Sunset-Red colored Aviso logomark to key AI columns along with a deep blue-ish purple (that we call Evening-Blue) font color to any data that is powered by our AI core.\n\n<img class=\"size-full wp-image-8379 aligncenter\" src=\"https://assets.uiaas.io/web/aviso/blog/AI-Branding.webp\" alt=\"\" width=\"1266\" height=\"612\" />\n\nFor our beloved current customers -- these changes mean only that existing product features will be easier to use and more seamless with your daily workflow.\n\nFor future customers -- we welcome you to explore a new Aviso unveiled for the first time. Join us on this journey as we bring the future of selling to the world.\n\nWe hope this new Lighthouse UI direction and improvements to usability will allow users to better experience the incredible value Aviso brings to their revenue organizations.\n\nStay tuned for more posts that will go into greater detail about the key areas we made changes to, as well as many more exciting product updates to come!\n\nYours truly,\n\n<strong>Jesse Zackery, </strong>Head of Design",
	"slug": "a-new-aviso-the-philosophy-behind-our-ui-ux-refresh",
	"author": "Neha Nirkondar",
	"categories": ["AI for Sales"],
	"pub_date": "3/17/20",
	"pub_time": "9:25 AM",
	"description": "Aviso A New Aviso: The Philosophy Behind Our UI/UX Refresh. AI-powered forecasts, deal accelerating insights, and 360-degree visibility into forecast data."
}
