{
	"title": "Accelerate Remote Selling with Guided Collaboration",
	"image": "https://assets.uiaas.io/web/aviso/blog/Guided-Collab-Blog-Header-300x150.webp",
	"content": "The recent pandemic has led to unprecedented measures as efforts to restrict the spread of the virus persist. From shutting down restaurants and in-person stores to canceling large events, businesses around the globe have been forced to adapt to widespread shelter-in-place regulations.\n\nThe largest shock to companies, however, has been the transition of its employees to remote work from home and relocation. This shift has had major impacts on collaboration, both internally and externally, from time zone differences and technical issues to delayed updates and slow response times. Beyond this, go-to-market and sales teams can no longer meet with customers face-to-face, which greatly impacts their sales processes and efficiency.\n\nNonetheless, as people have started spending more time at home, there has been a sharp rise in demand for digital collaboration and selling solutions. As a response, B2B sellers are uncovering new opportunities to optimize their sales execution by leveraging virtual selling tools, which include video conferencing, chat rooms, and virtual meetings. <a href=\"https://www.mckinsey.com/business-functions/marketing-and-sales/our-insights/the-b2b-digital-inflection-point-how-sales-have-changed-during-covid-19\">According to McKinsey</a>, more than 90% of B2B companies have transitioned to a virtual sales model during this time, replacing face-to-face sales conversations with synchronous and asynchronous communications.\n\n<img class=\"aligncenter size-full wp-image-9769\" src=\"https://assets.uiaas.io/web/aviso/blog/90-Quote-1.webp\" alt=\"\" width=\"1800\" height=\"946\" />\n\nUtilizing advanced technology to drive optimal sales execution on all levels of the revenue cycle has become an increasingly sought-after approach to bridging the gap between the office and WFH. Whether it be closing more deals, breaking down communication silos, or maintaining constant alignment across your teams, using AI-powered Digital WarRooms help supercharge internal and external collaboration with machine learning insights and guidance.\n<h3><strong>Forecast Rooms</strong></h3>\nAviso’s Forecast Rooms are built specifically for aligning Sales Operations, Strategy, and Field teams prior to Monday morning forecast meetings and deal review calls. Our Forecast Rooms allow for a consolidated view of all forecast-related insights that can be filtered based on regional, product, or other business pivots. These insights are surfaced directly into the sidebar for increased transparency, ease of communications, and maximized efficiency and collaboration for all members of the rooms.\n\n<img class=\"aligncenter size-full wp-image-9770\" src=\"https://assets.uiaas.io/web/aviso/blog/Forecast-Rooms.webp\" alt=\"\" width=\"1800\" height=\"942\" />\n<h3><strong>Deal Rooms</strong></h3>\nAviso’s Deal Rooms are the one-stop location for all things deal-related.\n\nSimilar to Forecast Rooms, the insights panel surfaces deal-specific insights, allowing for easy access and optimal productivity during chat messaging, forecast meetings, and deal review calls. Deal Rooms also organize deal-specific assets into folders, which could include marketing collateral, Close Plans, Statements of Work, and other various document types. Lastly, members of the rooms can assign tasks with the To-Do’s feature, fostering a sense of accountability on both an individual and team level.\n\nWith its own collaboration space, sales teams and other members of the rooms can stay in a constant loop on updates surrounding deal activity, enabling continuous teamwork and collaboration through all stages of the sales cycle.\n\n<img class=\"aligncenter size-full wp-image-9771\" src=\"https://assets.uiaas.io/web/aviso/blog/Deal-Rooms.webp\" alt=\"\" width=\"1800\" height=\"943\" />\n<h3><strong>Smart Transcription</strong></h3>\nOn a weekly basis, our Forecasting Rooms and Deal Rooms will archive recordings of forecast and deal review meetings, which are simultaneously transcribed by our AI tools. Aviso Smart Transcripts and Highlights then apply text and speech analysis, as well as sentiment analysis to automatically translate your usual meeting minutes into meaningful, quantitative insights. With a greater understanding of meetings’ overall tone and sentiment, users can leverage these insights to take smart actions, improve internal team alignment, and better serve customer’s needs.\n\n<img class=\"aligncenter size-full wp-image-9774\" src=\"https://assets.uiaas.io/web/aviso/blog/Smart-Transcription-2.webp\" alt=\"\" width=\"1800\" height=\"943\" />\n<h3><strong>Coaching Rooms</strong></h3>\nAviso’s Coaching Rooms span across the entire business, providing sales representatives and managers the most relevant, data-driven insights they need to construct detailed coaching plans and recommendations. With Aviso’s Sales Owner Scorecard, managers are able to compare performance across various teams and identify which reps need more coaching.\n\n<img class=\"aligncenter size-full wp-image-9778\" src=\"https://assets.uiaas.io/web/aviso/blog/Coaching-Rooms.webp\" alt=\"\" width=\"1800\" height=\"943\" />\n<h3><strong>Beyond Flattening the Curve</strong></h3>\nLooking past COVID-19, the intricacies of internal and external collaboration will still be prevalent to in-person work environments. Virtual chat rooms, video meetings, and screen sharing are all common components of communication in a modern-day workplace, even when companies are back to collaborating in the same space.\n\nIn today’s increasingly globalized world, multinational companies rely on effective virtual collaboration tools for better ease of communication across borders. AI-augmented collaboration provides both sales and go-to-market teams with a sustainable, long-lasting solution to engaging modern buyers, closing more deals, and ensuring customer satisfaction beyond flattening the curve.",
	"slug": "accelerate-remote-selling-with-guided-collaboration",
	"author": "Amit Pande",
	"categories": [
		"AI for Sales",
		" Opportunity Management",
		" Sales Analytics",
		" Sales Forecasting",
		" Sales Leadership"
	],
	"pub_date": "10/22/20",
	"pub_time": "9:27 AM",
	"description": "Aviso Accelerate Remote Selling with Guided Collaboration. AI-powered forecasts, deal accelerating insights, and 360-degree visibility into forecast data."
}
