{
	"content": "<p>As your team and pipeline get bigger, so does the stress of staying on top of each deal and making sense of all the available data. Sales ops professionals need to optimize results by assessing and determining different territories, while sales leaders and CXOs need to evaluate the total opportunity landscape to define their strategy. However, the biggest challenge these roles have is the lack of visibility into their total addressable target market and the data to strategically allocate resources. They require reliable data and insights at the right time to help power their decisions.</p><p>Today, artificial intelligence (AI) is transforming sports with match predictions, player performance, and real-time personalized training plans. We believe every sales rep and team member should have access to the same cutting-edge AI insights that the best sports players and teams do.</p><p>Aviso’s AI-based Owner Insights shows a user how a CRM opportunity owner performs. For example, a sales manager gets insights specific to the strengths and weaknesses of a particular sales rep, such as a greater conversion rate on commit deals but a poorer track record on converting larger deals.</p><p>Also, learn how your reps perform compared to their own baseline and to other reps for different types of insights, such as Forecast Category, Stage, Close Date, Amount, Cycle Time, and Commit Accuracy. Insights also include activity and advanced sentiment intelligence metrics on email conversations.</p><p>Aviso’s AI shows 6 types of owner insights:</p><ul><li><b>Forecast Category</b> - This tells about the owner's behavior/ performance historically for similar opportunities relative to other reps at the company.</li><li><b>Stage</b> - This shows how the owner behaved/performed historically for similar opportunities that have passed a certain stage relative to other reps at the company.</li><li><b>Close Date</b> - This insight tells how often the owner historically has pushed out similar opportunities relative to other reps at the company.</li><li><b>Amount</b> - This tells how the owner historically has increased or decreased the amount of the deals.</li><li><b>Cycle Time</b> - This shows you information about the age of the current deal with respect to the average cycle time of similar deals for the owner.</li><li><b>Commit Accuracy</b> - This insight gives information about the historical commit accuracy of the owner.</li></ul><p><br/><img src='https://assets.uiaas.io/web/aviso/blog/owner-insights-img-1.webp' alt='Owner Insights' /><br/></p><p>In the Aviso platform (as shown above), you can navigate to Owner Insights in two easy steps:</p><ul><li>Select a deal from the Deal Tab<br/><img src='https://assets.uiaas.io/web/aviso/blog/owner-insights-img-2.webp' alt='Owner Insights' /></li><li>Click on the slider navigation on the Insights window.<br/><img src='https://assets.uiaas.io/web/aviso/blog/owner-insights-img-3.webp' alt='Owner Insights' /></li></ul><br/><p>With Aviso Owner Insights, you also get nudges that help you make coaching a regular habit instead of a restricted event.</p><p>We hope you will find this feature helpful in discovering timely coaching moments and creating high-performing selling teams!</p><p>Let us know if you face any issues or have any additional feedback/ suggestions by emailing us at <a href='mailto:support@aviso.com'>support@aviso.com</a>.</p>"
}
