{
	"content": "<p>At Aviso, we believe in adding significant value through each feature release we roll out. Driven by user requests, keeping up with the competition, and executing our up-market vision, this update addresses the popular customer asks across the entire product.</p><p>This product update includes improvements to UI, forecasting, conversational intelligence, and more actionable insights for sales teams to know and double down on with time. Release Highlights</p><h2>1) A Brand New Deal Grid</h2><h3>What is it?</h3><p>The deal grid is where your frontline revenue champions can assess the deals that need the most attention and quickly take action. This revamp enables teams to create and deploy views, filter columns to view more specific information, and group columns by deal owner, category, stage, type, etc.</p><p>We've created a deal grid that is customizable and intuitive to the end-user. As a first step towards making the Aviso interface easier to navigate for all users, we have improved our interface's overall color contrast and sharpness so that different elements on the Deal Grid are well distinguished. The revamped UI enables the end-user to get all pertinent information and insights at a glance.</p><h3>Why is it important?</h3><p>Revenue teams should spend more time closing deals and building relationships with prospects, not discerning and searching for data they need. Sales teams deserve both function and form. With Aviso’s new deal grid, they will be able to create customized views, change deal categories, and pull deals in and out of the forecast while also having a great experience doing it.</p><h3>How does it help?</h3><ul><li>Expedites the deal review process, pinpoints deals at risk for leadership and avoids analysis paralysis.</li><li>Makes it easier and faster for users to execute tasks with its user friendly and intuitive interface</li><li>Improves CRM hygiene by enabling users to build curated views with details they need the most, making sure these details are actually captured and synced back to CRM</li></ul><p><img alt='image6' src='https://assets.uiaas.io/web/aviso/blog/apr-pu-image6.webp'></p><br><h2>2) Advanced Behavioural Call Metrics</h2><h3>What is it?</h3><p>In addition to nine other call metrics (Talk Ratio, Question Rate, Topics Duration, Topics Timings, Longest Monologue, Weekly Call Volume, Weekly Call Duration, Total Call Volume, and Total Call Duration) we’ve included two new behavioral call metrics: Interactivity Ratio (a measure of rep effectiveness by analyzing the frequency with which the speaker switches on a call) and Patience Ratio (a measure of the duration of pause taken by reps before addresing an objection).</p><h3>Why is it important?</h3><p>Sales managers need to understand how their team members fare in each call, especially in the areas of rep effectiveness and objection handling, so they can understand how their top deal-closing reps are performing and coach others. Interactivity and patience ratios are important metrics enabling sales managers to close the loop in measuring great rep performance and replicating that behavior across the team.</p><h3>How does it help?</h3><ul><li>Interactivity ratio provides managers with insight into how well that rep was able to keep the prospect engaged throughout the call.</li><li>Patience metrics help managers gauge whether reps are pausing addressing an objection. Successful sellers are known to wait longer and show a sense of calm in the face of adversity, which is a crucial part of objection handling.</li></ul><p><img alt='image4' src='https://assets.uiaas.io/web/aviso/blog/apr-pu-image4.webp'></p><br><h2>3) Enhancements To Transcription PDF Download</h2><h3>What is it?</h3><p>Instead of just presenting you with a meeting transcript, we run all your meetings through AI to generate important call and behavioral metrics, downloadable as PDFs from respective <a href=\"https://www.google.com/url?q=https://www.aviso.com/product/embedded-collaboration&amp;sa=D&amp;source=editors&amp;ust=1653664883857512&amp;usg=AOvVaw2Nf_9p6yjbzifcTHvYTqYf\">collaboration/deal rooms</a>. With this update, a feature we dubbed 'SmartTranscripts' becomes even smarter and now comes with more relevant data points that can help your reps succeed.</p><p>With this new enhancement, we showcase these eight new additions in the PDF: sentiment graph, sentiment score, emotions, speaker timeline, transcript summary, next steps summary, next steps speaker turns, CI metrics, and keywords highlights.</p><h3>Why is it important?</h3><p>Sales reps and sales leaders previously had to go through an entire transcript to understand the next steps, keywords highlighted, competitor mentions, what the prospect felt about the conversation, etc., to gather meaningful insights. This saves their time to focus on more essential deal activities.</p><h3>How does it help?</h3><ul><li>Helps leaders with quick insights on each call to coach reps on specific areas to improve their conversation techniques.</li><li>Important stakeholders who were not in the meeting can get up to speed in no time with the call summary and transcripts and ask clarifying questions after reviewing the metrics of the call.</li></ul><p><img alt='image2' src='https://assets.uiaas.io/web/aviso/blog/apr-pu-image2.webp'></p><br><h2>4) AI driven pipeline insights for future quarters</h2><h3>What is it?</h3><p>Let's say your next quarter's quota is $10 million. How do you know whether you have enough in your pipeline to meet that quota starting next quarter? Aviso's out-quarter pipeline forecast feature is built to inform you about how much pipeline you are generating for the next quarter and what your pipeline should be at the start of it to meet the quota.</p><p>With this feature, users can obtain these data points on the fly:</p><ul><li>Pipeline Composition: Color-coded bar charts that show the current pipeline (this quarter's pipeline closing in the next quarter) and the target pipeline (pipeline needed at the start of the next quarter to meet the target quota). This gives a fair idea of the pipe composition necessary to attain the quota by clearly demarcating the split between new and follow-through businesses.</li><li>Quarterly Forecasts: The quarter drop-down menu shows the out quarter forecast for the next three quarters: q+1, q+2, and q+3, with stacks differentiating between early-stage and late-stage pipe.</li><li>Pipeline Health Insights: These are actionable and contextual recommendations based on historical data to add more deals, push in/out deals, and take control of your pipeline.</li></ul><p><img alt='image1' src='https://assets.uiaas.io/web/aviso/blog/apr-pu-image1.webp'></p><h3>Why is it important?</h3><p>Towards the end of each quarter, sales reps and revenue leaders focus exclusively on opportunities likely to close within the quarter. While it's vital to keep a tab on the current quarter's pipeline, they must prioritize planning for the next quarter's pipeline well in advance.</p><p>Out-quarter pipeline is critical because a slow start to a quarter can set you behind for the rest of the year. Entering a quarter with a certain amount of pipeline will ensure that you hit and exceed your revenue targets.</p><h3>How does it help?</h3><ul><li>Enables sales teams to predict three upcoming quarters at any point in the given quarter.</li><li>Informs you of early-stage pipeline - Even with enough pipeline, Aviso can tell if too much of it is in early stages, so you can pivot from creating more net new pipeline to accelerating deals to later stages.</li><li>Informs you of late-stage pipeline - If the overall pipeline number is low, but there are deals in later stages to support revenue targets, you can continue focusing on generating net new to backfill the pipeline that turns into revenue</li><li>Improves sales rep performance and motivation ensuring that they're well-prepared for their upcoming revenue targets.</li></ul><br><h2>5) Forecast Analytics Chart</h2><h3>What is it?</h3><p>Aviso’s new forecast analytics chart provides metrics like quota, open and closed pipeline, along with an AI projection, team's commit, manager's commit within the forecast screen.</p><h3>Why is it important?</h3><p>We didn’t want leaders flitting between multiple modules and tabs when they reviewed how their best case and commit sales judgment numbers are against the quota and how they were trending week-on-week. The new forecast analytics chart on the side pane will help leaders review how the forecast has evolved in a particular week in a quarter, for a particular forecast node on a single screen.</p><h3>How does it help?</h3><ul><li>​​Shows how the forecast has changed over time, with context, within the Forecast tab, saving time and effort.</li><li>Helps keep intuition and guesswork at bay and helps users know how far the actual forecast is from the planned quota.</li><li>Hold reportees accountable to the forecast number they quote. This allows managers to determine which of their reps have called higher or lower.</li></ul><p></p><p><img alt='image3' src='https://assets.uiaas.io/web/aviso/blog/apr-pu-image3.webp'></p><br><h3>6) Engagement Grade Explanations</h3><h3>What is it?</h3><p>Aviso generates an engagement grade for each deal. This engagement grade depends on the number and frequency of emails, meetings, and attachments that are shared between the seller and buyer, in addition to the different touchpoints and roles sellers engage with. With this feature enhancement, Avsio’s AI not only generates an engagement grade related to the deal but also explains the reason why the deal’s engagement was high or low.</p><h3>Why is it important?</h3><p>Understanding rep-prospect engagement is critical to maintain the right level of relationships. Engagement scores measure relationship health, and the explanations inform managers on whether their reps were engaging with the right level of contacts at the right frequency.</p><h3>How does it help?</h3><ul><li>Helps sales teams evaluate and course-correct their approach to engage prospects. For example, if an exec-level engagement was trailing off close to a big renewal, then that is something a rep would like to be kept informed on.</li></ul><p><img alt='image5' src='https://assets.uiaas.io/web/aviso/blog/apr-pu-image5.webp'></p><br>"
}
