{
	"content": "<div class='uk-flex uk-flex-middle'><img  class='uk-border-circle uk-box-shadow-large uk-border uk-height-small uk-margin-right uk-background-secondary' alt='Brian Young' src='https://uiaas.sfo2.cdn.digitaloceanspaces.com/web/aviso/brian_young2.webp' /><span class='uk-text-middle'><div class='uk-h4 uk-margin-remove-bottom'>Brian Young</div>Global Commercial Leader, Johnson Controls & 3M</span></div><p>As part of Aviso's <b>Revenue Navigators Series</b>, we spoke with <a target='_blank' href='https://www.linkedin.com/in/brian-young-6a146a18/'>Brian Young</a>, a global commercial leader who has worked with Johnson Controls and 3M. Headquartered in Cork, Ireland, with over 97,000 employees, Johnson Controls is a provider of Fire HVAC Security Equipment and Controls. And headquartered in Minnesota, US, with over 95,000 employees, 3M is a leading industrial machinery manufacturer. As a business leader with extensive experience in selling, Brian spoke about his career journey, why he chose Aviso as an Investor/Advisor, the evolution of data in commercial sales over the years, and the importance of a single pane of glass.</p><p class='uk-h4'>Aviso: Can you share your career journey with us?</p><p><b>Brian Young:</b> I was a salesperson for 3M, selling products like sandpaper and tape adhesives. My days were filled with long hours spent traveling between shops, demonstrating products to customers. During my time working as a salesperson, I realized just how important it is to have an understanding of and appreciation for customers. After ten years, this experience helped shape who I am today, a customer-centered individual with empathy toward others' needs in order to fulfill their expectations. As I went on in sales management, one job remained: being a powerful point for influence. The higher up you go in your company's hierarchy, the more responsibility is given to each individual person who fills it.</p><p>The next big pivot for me was actually in a global role. I had the opportunity to run one of 3M subsidiaries internationally, and that gave me a clear perspective on how things worked across more than 50 countries. When I ran the Dutch subsidiary of 3M, they also made me the business leader for Canada. But when a CEO transition happened and new leadership took over, I was made what's called \"the first functional sales leader\". I made one of the most important decisions in my career, and it paid off. With only 5,000 salespeople at this company, we decided to become customer-centric by purchasing 30,000 Salesforce licenses because I thought all those employees who touch customers should be on the platform.</p><p class='uk-h4'>Aviso: What inspired you to join Aviso as an Investor and an Advisor?</p><p><b>Brian Young:</b> Friction is something that every organization struggles with. I was able to identify some areas of friction in my CRM system, but it's not just user issues or cultural problems; there are also best-selling salespeople who don't get proper access to data. The problem I was having with my sales process was that there were too many people in the car, and when we were all on our own and had to ride alone, it felt like every engagement could have been different. I've always been fascinated with data and how it can be used to solve sales problems. That's why when I found out that Aviso has access not only to the pipeline but also all of the deal information in one easy-to-use interface, there was no turning back.</p><p>In a world where data is king, Aviso provides an invaluable service by making it easier to capture and analyze all of the information you need for your business. This not only reduces friction during sales but also helps improve seller behavior with its advanced reporting features that give insight into every aspect of engagements. It's never been easier to do business with Aviso. I can focus on what matters most — managing the complexities of sales and marketing for our clients without worrying about all those little things that take up so much time.</p><p class='uk-h4'>Aviso: How have you seen the commercial sales process evolve with more and better data?</p><p><b>Brian Young:</b> Well, there's been a lot of change in the sales process. We used to take orders by phone and then send them through with pads of paper at each end, stamping them onto call reports before mailing them off, using phones ourselves for customer service, etc. All those days still seemed very much alive even though they are long gone now. Fortunately for me, the phone was eventually invented, and now we can talk on our phones while driving. In those days, it seemed like a crazy idea that you would want to stop your car in order to call someone up, but times have changed.</p><p>When Covid hit, Johnson Controls was early on in the transformation journey. We were just starting to execute our playbook around driving commercial standardization. April 2020 will forever remain a landmark because of how much success we experienced with the being closed throughout each quarter. There were days when I thought this would not work, but the more we pivoted and changed things up in our virtual organization, the better it became for those who sell.</p><p>Data has been an integral part of marketing for as long as there have been computers. The role that data plays in today's virtual selling model went through many changes over time. It's a real game-changer when data is available in an easily accessible way. I love the work that we're doing with Aviso because it makes my job so much easier by providing me access to all this information at any given time — no matter where I am or what device I'm using.</p><p class='uk-h4'>Aviso: What are the potential benefits you see for Aviso’s single pane of glass at Fortune 500 companies?</p><p><b>Brian Young:</b> If you're a CXO, your focus should be on the bottom line and how to increase it. That's what we all care about as C-suite executives, the growth of our business so that we can keep getting paid. And even though some might say I have a more direct role in delivering solutions for customers, at this point, there are still many factors involved with achieving success: increased productivity to achieve higher sales numbers is one way.</p><p>The C-suite needs solutions like Aviso to cut down on the amount of work that salespeople are doing. They might already be doing some things, but it can always help in areas like capturing data from sellers and making sure they're following up properly, so companies get profit out of those activities. Leaders will find this useful because we want everyone working for us to put forth 100 percent.</p><p>So with a solution like Aviso, I always think of the board-level impact. I want to make a difference in my spending, whether it's by reducing or increasing volume at higher rates than before — that is ultimately what drives me.</p><p class='uk-h4'>Conclusion</p><p>In this interview, Brian Young spoke about his career as a front-line seller with 3M and how he drove businesses across 50+ countries. He shared some of the problem statements that his CRM system had and the shift in usage of data over the years in commercial sales. He also shared how a comprehensive revenue solution like Aviso creates a board-level impact.</p><p>Aviso helps modern revenue teams close more deals, drive revenue growth, and mitigate risk with an AI-guidance platform for virtual selling. Aviso enables sales managers to utilize specific nudges in their decision-making process to improve their team’s performance and maximize the company's profitability.</p><p>If you are interested in learning more about Aviso's revenue intelligence platform, please sign up <a href='/contact'>here</a>. You can also view videos of Brian’s <a href='https://www.youtube.com/watch?v=BNTJsA3mmXI' target='_blank'>career journey</a>, his <a href='https://www.youtube.com/watch?v=0742ZXIh55w' target='_blank'>inspiration to join the Aviso board</a>, his understanding of the <a href='https://www.youtube.com/watch?v=CQnB7fwxeMs' target='_blank'>evolution of the commercial sales process</a>, and why he thinks <a href='https://www.youtube.com/watch?v=U8tmQrCf0SU' target='_blank'>a single pane of glass</a> is important in sales today. In addition, you can also read other customers' success stories <a href='/customers'>here</a>.</p>"
}
