{
	"title": "CRO's and CFO's - New Best Friends",
	"content": "<h4>In many industries, the chief revenue officer (CRO), also known as the VP of worldwide sales, and the chief financial officer (CFO) are typically not the best of friends. This isn’t great, because these two roles need to get along for companies to thrive and succeed in a competitive marketplace. In fact, in healthy companies, the CFO and the CRO are best friends.</h4>\n<h2>Understanding the CFO Job Function</h2>\nWhy does conflict exist between the people who hold these roles? We can begin to see where things go awry by examining the job function of the CFO, who is accountable to the CEO for financially planning most aspects of the company. He or she needs to provide accurate projections to the board and shareholders, execute cash management, and create quarterly and annual top- and bottom-line plans.\n\nWhat often gets in the way of planning and budgeting is the inability of the sales organization to accurately forecast revenue for the quarter (never mind forecasting two quarters out).\n\nBecause arriving at an accurate forecast is essential for the CFO’s job function, often the CFO will listen in on sales forecast calls to get a sense of quarterly progress. One of the biggest complaints from CFOs is that, while they feel the sales team has a reliable outlook on some of the quarter’s pipeline, there are often blind spots that come from heavy reliance on gut feel and human intuition. These blind spots lead to missed forecasts, which reduces the CFO’s confidence in the numbers the sales team delivers.\n<h2>When Sales Forecasting Questions Go Unanswered</h2>\nIt’s understandable why the CFO would want to be involved in the forecasting process; however, friction can arise when unsolicited advice is given on how to execute deals.\n\nAdditionally, CFOs will often ask the following basic and valid questions the sales team can’t easily answer.\n\n<strong>“What changed in the forecast since last week?”</strong>\n<strong> “How much business do you expect to pop up and close in-quarter?”</strong>\n<strong> “How are you doing versus this time last year or this time last quarter?”</strong>\n<strong> “What pacing of deals closing do you need throughout the quarter to make the number?”</strong>\n\nOn many levels, it’s no longer acceptable for the sales team not to have this information at their fingertips.\n<h2>The Problem with Spreadsheets and CRM Reports</h2>\nThe problem is, the majority of sales teams are still using spreadsheets and CRM reports, which makes obtaining historical information, making predictions, and detecting trends difficult. A complicated spreadsheet is simply a compilation of what is in CRM along with gut and intuition. The more the sales leader relies on spreadsheets and gut, the more he or she loses credibility with the CFO and CEO.\n\nThere is a better way.\n\nWith the introduction of artificial intelligence (AI) and machine learning for revenue-generating sales processes such as forecasting, the CFO, and senior sales executives are more aligned than ever.\n\nThrough AI-based sales planning and forecasting, sales executives can let data drive the conversation. For example, a sales executive can now leverage a trend line of closing business to prove that his or her team will exceed plan by the end of the quarter. Additionally, they can back up their intuition on close date with AI-driven smart selling signals that show which deals are most likely to close this quarter, push into next quarter, or be lost opportunities.\n<h2>The Difference AI Makes: Achieving Accurate Sales Forecasts</h2>\nWith AI projections, on the first day of the quarter, sales executives can tell the CFO with 90-95 percent accuracy what the end-of-quarter number will be... AND where they will land next quarter!\n\nAdditionally, with an AI-enabled platform, sales executives can now tell the CFO what business will close that wasn’t in the pipeline at the beginning of the quarter.\n\nWith confidence in the forecast, the CFO can plan, put hiring models in place, execute spending to meet cash flow objectives, and – lo and behold – create an annual bookings plan that is based on reliable data vs. the growth rate they want to achieve for the next round of funding or pleasing shareholders.\n\nA note of caution: Unless sales execs become more analytical using accurate, predictable data, they will be marginalized by other departments – not viewed as a data-driven sales executive. Make the transition from reliance on gut, intuition, and spreadsheets to a new era of AI-generated insights. The sales executive graveyard of those who haven’t embraced the science of selling continues to grow. Don’t be one of them.\n\nBy introducing them to these technologies, Aviso has already turned CFOs and sales executives into best friends at many high-tech companies.",
	"slug": "cro-cfo-new-best-friends",
	"author": "Neha Nirkondar",
	"categories": ["Sales Forecasting", " Sales Leadership"],
	"pub_date": "3/6/18",
	"pub_time": "3:53 PM",
	"description": "Aviso CRO's and CFO's - New Best Friends. AI-powered forecasts, deal accelerating insights, and 360-degree visibility into forecast data."
}
