{
	"content": "<p style=\"text-align: center;\"><span style=\"color: #333333;\"><em>Master the art of the discovery call with time-tested best practices and tips. </em></span></p> You did it: you successfully scheduled a call with a lead. Whether you arrived at this point through a cold call or a referral or a marketing effort, you managed to secure a time slot in the busy schedule of a potential client. Now what? As it turns out, this first call is crucial to setting the stage for your deal and managing future expectations. This is your chance to connect with your prospect and to leave a strong positive impression. <h2 style=\"text-align: left;\"><span class=\"ez-toc-section\" id=\"What_Is_A_Discovery_Call-2\"></span><span style=\"color: #bf416d;\"><strong>What Is A Discovery Call?</strong></span><span class=\"ez-toc-section-end\"></span></h2> <blockquote> <p style=\"padding-left: 40px; text-align: left;\"><span style=\"color: #000000;\">The <b>discovery call</b></span> is the first call you have with a prospect after they express interest. <span style=\"font-weight: 400; color: #000000;\">The primary purpose of this conversation is to identify whether the prospect is a good fit for you and your business. In other words, your objective is to qualify (or disqualify!) a buyer.</span></p> </blockquote> Go into a discovery call with the intent to <i>discover</i>. Imagine yourself as a doctor trying to diagnose a patient. Rather than prescribing medication right off the bat, you should seek to uncover their problems and needs. In a discovery call, you'll have the opportunity to ask questions and learn more about your buyer: who they are, what role they play in their organization, what pain points or needs they have, and what their goals are. <img class=\"aligncenter wp-image-11035\" src=\"https://assets.uiaas.io/web/aviso/blog/Group-1247-2-683x600.webp\" alt=\"Discovery calls\" width=\"383\" height=\"337\" /> A great call begins by building rapport and identifying whether the solution you provide fits into your prospect’s needs. It’s important to nail these questions down first before you move into talking about your solution, or else you might be wasting your time or worse, risk <span style=\"color: #bf416d;\"><a style=\"color: #bf416d;\" href=\"https://www.inc.com/wanda-thibodeaux/why-aggressive-selling-doesnt-work-and-what-actually-does.html\" target=\"_blank\" rel=\"nofollow noopener\">ruining the relationship before it’s even begun</a>.</span> Sounds daunting? Don’t worry. With a little bit of preparation, discovery calls can be simple and straightforward. Below, I’ve listed an essential roadmap with the 3 steps to follow in order to streamline your discovery calls, including a pre-call checklist and examples of discovery call questions. Let’s get started! <h2 style=\"text-align: left;\"><span class=\"ez-toc-section\" id=\"The_3_Steps_to_Execute_a_Rock-solid_Discovery_Call-2\"></span><span style=\"color: #bf416d;\"><strong>The 3 Steps to Execute a Rock-solid Discovery Call:</strong></span><span class=\"ez-toc-section-end\"></span></h2> <h3 style=\"text-align: left;\"><span class=\"ez-toc-section\" id=\"Step_1_Research_Your_Prospect-2\"></span><strong><span style=\"color: #993366;\">Step 1. Research Your Prospect:</span></strong><span class=\"ez-toc-section-end\"></span></h3> Preparing for your discovery call is half the battle. Each prospect is unique, and it’s important to tailor your approach to each client in order to best optimize your upcoming conversation. <b>Start by setting out 10-15 minutes to scope out your lead. </b>Here, you’ll want to identify a “hook” -- a point of common interest or connection that hits the three Rs: <span style=\"color: #bf416d;\"><a style=\"color: #bf416d;\" href=\"https://www.sellingfromtheheart.net/blog/sales-professionals-are-real-relatable-relevant-with-their-clients-are-you\" target=\"_blank\" rel=\"nofollow noopener\">Real, Relatable, and Relevant.</a></span> Whether you share a love for travel or a mutual friend, your aim should be to establish an authentic connection built on trust. More than anything, your prospect wants to know they can rely on you to deliver on your promises. <b>Tap into the wealth of information available on the Internet</b>. A quick search on Google, LinkedIn or Twitter can provide a lot of insight into your prospect’s personal values and interests. Likewise, make sure to skim through their company’s <i>About Us</i> page, PR, blog articles, and associated social media to get a sense of the company’s organizational structure and overarching goals. Take a look into your CRM and <span style=\"color: #bf416d;\"><a style=\"color: #bf416d;\" href=\"https://www.aviso.com/crm-automation/\" target=\"_blank\" rel=\"noopener\">customer reporting tools</a></span> to see what information is already available. Review any previous interactions you might have had with your lead, such as emails or recorded conversations. Keep your eyes peeled for red flags that might disqualify your prospect. Recognizing that your lead is not a good fit is equally important and can save you valuable time and effort. Here are several pre-call questions to answer as you conduct your research: <img class=\"aligncenter wp-image-11034\" src=\"https://assets.uiaas.io/web/aviso/blog/Pre-Call-Checklist-1.webp\" alt=\"Discovery calls questions\" width=\"604\" height=\"556\" /> <p style=\"text-align: right;\"><strong>Also Read:</strong> <a style=\"color: #2c87f0;\" href=\"https://www.aviso.com/blog/crm-automation-benefits/\">Benefits Of CRM Automation</a></p> <h2><span class=\"ez-toc-section\" id=\"Step_2_Plan_Out_Your_Discovery_Strategy-2\"></span><strong><span style=\"color: #993366;\">Step 2. Plan Out Your Discovery Strategy:</span></strong><span class=\"ez-toc-section-end\"></span></h2> Use what you learned in your 10-minute research session to help you to create an effective outline for your conversation. <b>The next step is to structure a discovery call agenda. </b>Go into the discovery call with a clear vision of what you’re hoping to accomplish within the timeframe of the call and lay out a path with talking points and questions that will help you achieve this goal. You can tailor this structure to fit your needs and your client. Using a discovery call agenda, you can develop a script for each section and customize it to fit your own style. <img class=\"alignright wp-image-11036\" src=\"https://assets.uiaas.io/web/aviso/blog/Group-1248-1.webp\" alt=\"Discovery calls checklist step\" width=\"291\" height=\"277\" /> A typical discovery call will follow this basic structure: <ul> <li>Introductions</li> <li>Expectations</li> <li>Discovery</li> <li>Solution</li> <li>Next steps</li> </ul> Let’s walk through each of these sections individually. <b>Start with introductions</b>. The first few minutes of your discovery call are crucial. In this section, your goal is to build rapport and set the tone. Introduce yourself, your company, your role, and your solution’s <span style=\"color: #bf416d;\"><a style=\"color: #bf416d;\" href=\"https://www.wordstream.com/blog/ws/2016/04/27/value-proposition-examples\" target=\"_blank\" rel=\"noopener\">value proposition</a></span> in 20-30 seconds. Here’s where you can also use your “hook” to establish your connection with the prospect and to reassure them that you are trustworthy, reliable, and worth their time. <b>Set expectations</b>. Manage expectations by explaining to the prospect how you intend for the discovery call to unfold. You want the prospect to understand that this initial meeting is for you to learn about the prospect and their needs. <strong>Some best practices include:</strong> <ul> <li>Sharing your objectives for the meeting</li> <li>Outlining several main points</li> <li>Touching on future actions (e.g., “I’ll follow up with an email after our discussion today.”)</li> </ul> <b>Dive into discovery. </b>It’s time to dive into the heart of the matter: learning about your prospect’s needs and goals. Prepare a general list of questions that focus on qualifying/disqualifying the buyer. <h3><span class=\"ez-toc-section\" id=\"Discovery_Call_Checklist-2\"></span><strong>Discovery Call Checklist:</strong><span class=\"ez-toc-section-end\"></span></h3> Don’t know where to begin? Check out our checklist for discovery calls and questions you need to be asking: <ul> <li>Know the company</li> </ul> Start with trying to understand more about the prospect’s organization, their history, growth, and culture, so you get clarity on how you should be approaching certain situations. <ul> <li>Understand role and responsibilities</li> </ul> It’s imperative to know your prospect’s role and the responsibilities that come with it. Check job descriptions from competitors to understand what’s expected and structure your discussions so you align with their objectives. <ul> <li>Identify ongoing projects and goals</li> </ul> Try and get a sense of what are the current projects they’re working on and what their goals are. This will provide valuable insights on how you can make your approach more relevant and timelier. <ul> <li>Analyze business impact</li> </ul> Have conversations to figure out the business impact of ongoing projects and the repercussions of not being able to reach the goals. This will help you understand the complexity of these projects and their importance to the business. <ul> <li>Understand costs</li> </ul> Learn if there’s an assigned budget for the project so you get the full picture and can manage your discussions effectively. <ul> <li>Know their history</li> </ul> Find out if your prospect has made similar purchases in the past so you know what you’re up against. It’s critical to know about historic purchases so you can highlight your unique features and point out competitor shortcomings. <ul> <li>Uncover pain points</li> </ul> For discovery calls to be successful you need good insights, and nothing beats finding out the challenges your prospect is facing, so you can help with eliminating them. <ul> <li>Map processes</li> </ul> Learn how your solution can fit into the prospect organization’s processes. Get a good understanding of the current process and how your offering could fit into it, quickly and effectively. <ul> <li>Know your enemy</li> </ul> Find out the other options they’re considering along with yours. Knowing your enemy will help you manage your outreach and engagement to showcase your value while demonstrating superiority. You’ll want to pay close attention to your prospect’s tone of voice and what they say and consider what this might mean for the deal. For instance, if your prospect tells you that a higher-up is responsible for the budget, you might be speaking to the wrong person. <img class=\"aligncenter wp-image-11037\" src=\"https://assets.uiaas.io/web/aviso/blog/Talk-Duration-1.webp\" alt=\"Discovery calls checklist steps\" width=\"363\" height=\"200\" /> Remember also that a discovery call should be a two-way dialogue. As a rule of thumb, <a style=\"color: #bf416d;\"><span style=\"color: #c7344a;\">a good talk-to-listen ratio is 50:50</span></a>. Don’t just grill your prospect with a never-ending list of questions! <b>Share your solution</b>. After you’ve qualified your lead and are satisfied with the information you’ve acquired, you can move on to discussing your solution. Many discovery calls will include a soft sell-- a low-pressure explanation of your product or service, often accompanied by FAQs, objections, and customer case studies. Most importantly, you should touch on the needs and pain points of your prospect. Why should they care about your product or service? Align your solution with a challenge they mentioned earlier in the conversation. Address any potential objections and share success stories from clients similar to your prospect. <b>Proceed with the next steps. </b>Wrap up your discovery call with a shared understanding of what will happen next. Leave off future actions for a second interaction. Depending on the information you’ve gained, you might want to schedule a second call to conduct a demo or discuss personalized pricing. If you find that your prospect is not a good fit for your business, you could let them know that you’ll reach out with a follow-up email later. <img class=\"aligncenter wp-image-11038\" src=\"https://assets.uiaas.io/web/aviso/blog/Modal-Next-Steps-1-1.webp\" alt=\"Discovery call checklist\" width=\"371\" height=\"262\" /> <p style=\"text-align: right;\"><strong>Also Read:</strong> <a style=\"color: #2c87f0;\" href=\"https://www.aviso.com/blog/sales-metrics-analytics/\">Important Sales Metrics</a></p> <h2><span class=\"ez-toc-section\" id=\"Step_3_Keep_An_Open_Mind-2\"></span><strong><span style=\"color: #993366;\">Step 3. Keep An Open Mind:</span></strong><span class=\"ez-toc-section-end\"></span></h2> Congrats! You’ve done your research, filled out your agenda, and now you’re geared up to nail the discovery call. Finally, it’s time to meet your prospect. The key to success here is <i>flexibility</i>. Go with the flow -- it’s okay to break script and ask questions you feel are relevant to the discovery call. Here are some tips for an effective conversation: <ul> <li><b>Ask open-ended questions</b>. Leave room for your prospect to expand on their answers. If they’re giving one-word replies, prompt them with a statement such as “Tell me about ___.”</li> </ul> <ul> <li><b>Listen and empathize</b>. People like to be heard. Pay attention to what your prospect says, validate their emotions, and offer up your own thoughts in response.</li> </ul> <ul> <li><b>Ask for feedback</b>. It’s good practice to ask your prospect how they feel about the conversation and if they have any questions. Here's your chance to clear up any lingering confusion or misunderstandings.</li> </ul> <ul> <li><b>Keep an open mind</b>. Sometimes, after all of your preparation, things don’t go as planned -- and that’s alright! You’ll leave the conversation having learned from the experience.</li> </ul> <ul> <li><b>Leave a positive impression</b>. As you conclude your discovery call, remind your prospect of the benefits of your solution. Let the prospect know that you enjoyed the conversation and that you’re eager to work with them again.</li> </ul> <img class=\"aligncenter wp-image-11039\" src=\"https://assets.uiaas.io/web/aviso/blog/Conversational-Intelligence_Sentiment-1181x600.webp\" alt=\"Discovery calls checklist\" width=\"461\" height=\"234\" /> <h3><span class=\"ez-toc-section\" id=\"Power_Sales_Forecasting_with_AI-2\"></span><span style=\"color: #b53154;\"><strong>Power Sales Forecasting with AI</strong></span><span class=\"ez-toc-section-end\"></span></h3> If you want to drive accurate forecasts, look no further. Aviso has over six years of predictive AI modelling expertise proven at Fortune 500 ($5B+ scale) as well as high-growth business leaders. Our AI-powered predictive sales forecasting delivers unmatched accuracy, flexibility across net new and renewal business models, and enables deep customization. Aviso is the AI compass that guides sales and <a style=\"color: #2c87f0;\" href=\"https://www.aviso.com/blog/go-to-market-gtm-strategy/\">go-to-market teams</a> to close more deals, accelerate growth, and find their Revenue True North. Aviso delivers revenue intelligence to drive informed team-wide actions and course corrections. We offer precise guidance so that sellers and teams can avoid the fog of CRM and optimize their sales process with predictive AI. Interested in learning how Aviso can give you more sales team visibility and help achieve your forecasting goals with 98% accuracy every quarter? Sign up for a demo now <a style=\"color: #2c87f0;\" href=\"https://www.aviso.com/contact-us/\">here</a>."
}
