{
	"title": "Dreamforce 2018 Report",
	"content": "<h2>AI for Sales. The future has never been brighter!</h2>\nIt was another amazing Dreamforce and I’m happy to say that the future of AI for sales looks brighter than ever! The heavy traffic at the Aviso booth reinforced my belief that sales people are beginning to adopt AI into their processes.\n\nArtificial Intelligence was a central theme at this year’s event and we were proud to be a Bronze Sponsor. We met a lot of people in the booth and discussed how our customers are leveraging AI to close more deals and drive better outcomes.\n\nWe learned a lot from the interactions we had, as well as in meetings with prospects and customers. Universally, it seems that there are a myriad of interesting sales challenges to overcome. Here are just a few:\n<ul>\n \t<li>Lack of visibility for managers and reps to accurately identify the best deals in their pipeline, preventing them from focusing their attention where it matters most</li>\n \t<li>Absence of actionable, data-driven insights to proactively guide decision-making</li>\n \t<li>Inability to accurately and predictably forecast using spreadsheets</li>\n</ul>\nAfter speaking with sales leaders, sales managers and sales operations professionals, from a diverse set of industries, the hurdles they faced were similar. And, although the concept of using AI to solve these challenges was new to many, they listened intently, asked the tough questions, and walked away with a new perspective on the power and benefits of applying AI to sales.\n\nWe really enjoyed co-hosting the lively Happy Hour event at the 3rd Street Taproom with Groove and Clearbit.  It was great to see so many customers and prospects enjoying the venue, as well as the great beer and wine selection.\n\nWe look forward to continuing the conversation with everybody we met. We’d like to learn more about your businesses so we can explore additional ways to solve your long-standing sales challenges with AI. We invite you to check out this <a href=\"https://www.youtube.com/watch?v=NODcwqy-ye4\">recent clip</a> of Jay Flanagan from Dell EMC as he discusses how their sales team is using Aviso's AI to become more focused and highlight the steps they need to take to close more deals.",
	"slug": "dreamforce-2018-report",
	"author": "Editor",
	"categories": ["AI for Sales", " Events"],
	"pub_date": "10/5/18",
	"pub_time": "1:12 PM",
	"description": "Aviso Dreamforce 2018 Report. AI-powered forecasts, deal accelerating insights, and 360-degree visibility into forecast data."
}
