{
	"title": "Escape Velocity and Parabolic Arcs: How to Rocket Science your Startup",
	"content": "As a game theorist and mathematician by training and CEO of a disruptive AI startup, I’ve always been fascinated by the parallels between company building and launching rockets. Often folks casually throw around this phrase for a lot of things - \"it's not rocket science.\" I’ve always found that phrase a bit odd because there are so many aspects of successful space launches that can directly help technology startups scale into bold new frontiers.\n\nElon Musk and SpaceX have shown this by literally scaling a space startup into commercial viability. In 2008, SpaceX became the first private company to launch a liquid-fueled rocket into orbit, and just 10 years later, they successfully deployed CEO Elon Musk’s red Tesla roadster (driven by “Starman,” a mannequin in a spacesuit) into space and set it on course to orbit the sun.\n\nYet, SpaceX has also experienced major failures and setbacks, including three failed attempts to launch a rocket into orbit in 2006, 2007, and 2008. SpaceX has experienced the full range of successes and failures that define the startup journey, and they did it right before our eyes in the most visible setting possible.\n\nRegardless of what your company does, and whether you are the CEO, CTO, hardware or software AI engineer building the future, you, too, will have to navigate the ups and downs that are part of being a startup.\n\nIn this post, I cover the three critical steps you must take to get your startup off the ground, into orbit, and safely to your destination. Imagine a space station out there in the Milky Way, serene and calm from the outside, while moving at Mach 26. (A bullet moves at less than Mach 1.) Wouldn’t you like your startup to get there too?\n<h3><strong>Step 1: Create Escape Velocity</strong></h3>\nSpace itself isn’t as difficult to navigate. You just take off and go straight up and gravity is perhaps 1-2% less and it feels like molasses in the upper atmosphere. The real issue is escape velocity.\n\nTo successfully launch a rocket, you must achieve radical outward acceleration equal to the inward acceleration of gravity to reach net-zero gravity. Radical outward acceleration requires propulsion, and propulsion requires fuel — massive amounts of it. Your startup’s escape velocity is fueled by your first customers and key initial hires.\n\nThose first customers give you the cash and momentum needed to get your company off the ground. Your initial deals will also build confidence and credibility you’ll need to make those first few hires, who will be critical to company building.\n\nThe people you hire first are just as important as those first customers. They will help you execute and successfully deliver unmatched value to your customers, building on the relationships you’ve already developed and setting the table for more work.\n\nBeyond adding scale, your first hires should bring new skills to the organization to complement your skillset and increase the company’s capabilities. There’s just no substitute for nailing it in these first two moves. To achieve lift-off, you’ll have to land those first few deals and make great hires to help you start strong.\n<h3><strong>Step 2: Stabilize in a Parabolic Arc</strong></h3>\nOnce off the ground, you need to continue going up (growing), but in a more horizontal and stabilized trajectory until you reach orbit and deliver the payload, which could be a satellite, or in your case, products. You want to stabilize at Mach 10, in a coin funnel shape, and sustain a parabolic arc through consistent growth and expanding market share.\n\nThis is where your initial hires will prove themselves. Stability is a function of infrastructure and processes, and your core team should be building out both as they hire staff and drive execution. It is important to develop both soft and hard Infrastructure (right tools, right culture) around key functions such as pipeline and demand generation, customer development, project management, to stabilize your company as it grows.\n\nEstablishing a healthy trajectory is truly an exercise in competing priorities. On one hand, you have to keep growing and gaining market share and new customers. On the other, you have to continue delivering value to retain those initial customers who gave you the escape velocity you needed to launch. This requires talented managers. With your leadership, your core hires will be the ones to maintain the balance necessary to stay the course.\n\nHowever, there is no friction in space so how do you get to where you want to be, while keeping the company intact? You can add strategic funding or deals that act as nitrogen boosters. This can help you get a push to hypersonic.\n<h3><strong>Step 3: Survive the Trip Home</strong></h3>\nIf your company can reach escape velocity and stabilize growth for long enough, you will scale and eventually approach commercial viability. You can then use fins, e.g. add larger funding rounds, or bigger deals, to guide your company through hypersonic, supersonic, subsonic, transonic, levels with precision and detail to land at an exact spot in an island in the great oceans.\n\nWhile continued growth remains important, the emphasis now shifts further toward stability in the form of capital. You must secure strategic financing and land big, longer-term deals to reduce volatility and ensure continued growth over a longer period of time. At this point, your company is essentially growing out of the startup phase.\n\nFor a founder, this step is akin to the reusable portion of SpaceX’s Falcon Heavy Rocket re-entering the atmosphere after deploying Elon’s roadster. The objective is complete, and much like the Tesla, your company is on rails toward the goal. Now you can now focus on returning home. If you miss and you are in the ocean, and you lose everything including your payload. Even Elon Musk missed several times.\n\nIf you do it right, you will safely land in a precise location back on earth. If you miss, you could lose everything — and this is the risk that building a company, team, and successful journey requires.\n<h3><strong>Putting It All Together</strong></h3>\nYou could even say that building a startup has the same probability as building a rocket and landing it with boosters on a small island in the Pacific Ocean. Building a team, company, and category and exiting successfully is indeed rocket science and we can learn a lot from what the space startups are doing.\n\nIf you do it right on every front, you are a God. If you do it right on some fronts, you can keep trying over and over, working the science. If you don’t even try you will be on your rocking chair at 80 and wondering why you did not try. So adopt the Regret Minimization Framework as Jeff Bezos did and start sketching your trajectory today.\n\nP.S. You can<a href=\"https://spacein3d.com/mission/starman\"> track Starman’s orbit in near-real-time</a>, if you’re interested.",
	"slug": "escape-velocity-and-parabolic-arcs-how-to-rocket-science-your-startup",
	"author": "Trevor Templar",
	"categories": ["AI for Sales"],
	"pub_date": "12/22/20",
	"pub_time": "10:15 AM",
	"description": "Aviso Escape Velocity and Parabolic Arcs: How to Rocket Science your Startup. AI-powered forecasts, deal accelerating insights, and 360-degree visibility into forecast data."
}
