{
	"content": "<p>We’ve brought you a slew of feature enhancements, user experience updates, and better overall navigation within the Aviso Platform.</p> <h2>A New Home Landing page</h2><p>A good home landing page should be a one-stop shop for all the important information a company wants its employees (or the users themselves want) to see when they start their day. It should ideally include performance metrics, trends, analytics, and announcements, among other critical information.</p><p>Aviso is improving the way our customers start their work with an AI dashboard that gives you an at-a-glance view of key capabilities, including revenue forecasting, deal management, pipeline trends, and visual NLP analytics. This key upgrade enables easier navigation through the Aviso interface</p><p>This is the first page you'll see when you log in:</p><p><img alt='image4' src='https://assets.uiaas.io/web/aviso/blog/product-updates-image4.webp'></p><p>The main sections of the home landing page include:</p><ul> <li>Dashboard: Contains information regarding the current forecast, AI adaptive metrics, current quarter sales, next quarter pipeline, deal changes, top deals, and leaderboard.<p><img alt='image3' src='https://assets.uiaas.io/web/aviso/blog/product-updates-image3.webp'></p></li><li>Forecast: Shows Aviso’s AI forecast, plan, run rate, coverage ratio, booked, gap to quota, quota attained, commit, most likely, best case, deal level forecast, and open pipeline.<p><img alt='image7' src='https://assets.uiaas.io/web/aviso/blog/product-updates-image7.webp'></p></li> <li>Deals: Covers details around all deals such as owner, engagement grade, Aviso WinScore, and amount.<img alt='image1' src='https://assets.uiaas.io/web/aviso/blog/product-updates-image1.webp'></li><li>Trend: A graphical representation of Aviso’s total forecast, existing pipe, and new pipe forecast.<img alt='image8' src='https://assets.uiaas.io/web/aviso/blog/product-updates-image8.webp'></li><li>Analytics: Gives you the deals pipeline flow, and changes in deals with a close date in the current quarter (grouped by category).<p><img alt='image2' src='https://assets.uiaas.io/web/aviso/blog/product-updates-image2.webp'></p></li><li>Admin: Has all the administration level settings and access information.</li><li>Reports: This section includes all the forecast reports and pipeline reports.<p><img alt='image6' src='https://assets.uiaas.io/web/aviso/blog/product-updates-image6.webp'></p></li></ul></br> <h2>Pin Multiple Columns in Deals Grids</h2> <p>It is pertinent that your deals grid is easy to view, read, and understand. It should be simple enough for customers to glance at and get a quick overview of what's happening in a single frame. When you're trying to keep track of deals, it is really helpful to have them in a grid format with multiple columns. This allows you to track information such as the date of the deal, product or service being sold, commit accuracy, the amount of the deal, and the next steps for the seller.</p> <p>Aviso offers a way to keep all of the identifying information in view as you scroll down and across multiple rows of data in the deals grid. Multiple pins in Aviso assist you to view your columns and rows headings continuously while you scroll through the deals grid. It also enables you to keep a portion of the deals grid visible while you scroll to another deals grid area. Here’s how you can do it:</p><ul> <li>Hover to the column heads and click on the Pin icon to fix multiple columns.</li><li>Sometimes, you may not want to keep the multiple pin feature turned on after you have finished with the deals grid.</li><li>To unpin the columns, hover to the column heads and click again on the Pin icon.</li></ul></br> <h2>Auto-size Column Width</h2> <p>Aviso’s UI has been upgraded to ensure that your user experience remains effortless: Now, users can dynamically resize column widths in the deals grid, based on the contents of the grid. You can easily expand or shrink the column size based upon your use case. Aviso has been careful in our design to set a minimum width for the columns so that it does not cause overlap and overwrapping issues when column size changes.</p><p>Here’s how you can do it:</p><ul> <li>To quickly set the width of a column, hover the mouse over the edge of the column header.</li><li>Drag the mouse to increase or decrease the size of the column.</li><li>Now you’re all set to use the new view of your deals grid. </li></ul> <p><img alt='image5' src='https://assets.uiaas.io/web/aviso/blog/product-updates-image5.gif'></p><p>We hope you will find this feature helpful, and as always, let us know if you face any issues or have any additional feedback/ suggestions by emailing us at <a href='mailto:support@aviso.com'>support@aviso.com</a>.</p>"
}
