{
	"content": "<p>In December of 2017, Richard Thaler won the Nobel Prize for his influential research in behavioral economics. His ideas showed that decisions made under pressure are largely based on intuition and unconsciously guided by biases and psychological fallacies.</p><p>In the business world, it's important for decision-makers to sidestep these personal biases and quirks and act based on data, precedent, or both. Over the years, insights from behavioral economics, psychology, and neuroscience have shown that ‘nudges’ can influence behavior and drive productive decision-making.</p><p>That’s why we build context-based nudges into the Aviso platform. Aviso’s context-based nudges are interventions that use AI to help users make better decisions. These include behavioral interventions and decision-making support systems.</p><p>Aviso’s AI nudges feature not only helps prevent deal slippage by reminding users to act early and often on deal and team performance mishaps, but it also expedites deal execution by nudging sales team members with key insights and actions while moving a deal forward. What's more, these nudges can be customized according to the metrics that matter most to every user (from salesperson to CRO).</p><p> </p><p>Aviso's nudges make it fast and easy for persona-based insights to be delivered directly to your sales teams on the front line, so they're constantly in the know about the state of deals and the actions required to drive the business forward.</p><p>Users can choose from several types of nudges, including but not limited to:</p><ul> <li><b>Year Old Deals Nudges</b>: Informs users if the deals are open for more than 365 days that are in early stages of the opportunity cycle, thereby ensuring pipeline hygiene.<img style='max-width:420px;' alt='image6' src='https://assets.uiaas.io/web/aviso/blog/enhanced-nudges-image6.webp'><br/></li><li><b>Potential Deal Nudges</b>: Suggests users what the potential deals could be, usually with TCV that are closer to $1 Million. This can also be configured based on the company’s ARR and other necessary factors. <img style='max-width:420px;' alt='image7' src='https://assets.uiaas.io/web/aviso/blog/enhanced-nudges-image7.webp'><br/></li><li><b>Close Date Adjustment Nudges</b>: Notifies the user based on the pipeline or best case ahead of the close date. Usually deals that have close dates within 15 days are meant to be in the later stages of forecast category, when that’s not the case these nudges will be triggered. This helps deliver an accurate forecast in addition to maintaining pipeline hygiene. <img style='max-width:420px;' alt='image5' src='https://assets.uiaas.io/web/aviso/blog/enhanced-nudges-image5.webp'></li><li><b>High-Value Deal Nudges</b>: Notifies the user based on the ARR/TCV value, or the segment<br/></li><li><b>Opportunity & Forecast Mismatch Nudges</b>: Tells users if all the commit deals need to be in stage 4 or higher. Additionally, these nudges will flag opportunities with details that are different between levels (Manager vs. Account Executive).<img style='max-width:420px;' alt='image3' src='https://assets.uiaas.io/web/aviso/blog/enhanced-nudges-image3.webp'><br/></li><li><b>Stagnant Deal Nudges</b>: Reminds users if they didn't touch or update the opportunities for 15 days for example, no updates to any fields, no correspondence with the contacts, etc.<img style='max-width:420px;' alt='image9' src='https://assets.uiaas.io/web/aviso/blog/enhanced-nudges-image9.webp'><br/></li><li><b>Stale Nudges</b>: Informs users whether the close date of a deal is approaching soon, with the deal being in its early stages of the sales cycle.<img style='max-width:420px;' alt='image4' src='https://assets.uiaas.io/web/aviso/blog/enhanced-nudges-image4.webp'><br/></li><li><b>Competitor Nudges</b>: Informs users if the competitor field value has been entered and gives suggestions if the field is not populated.<img style='max-width:420px;' alt='image2' src='https://assets.uiaas.io/web/aviso/blog/enhanced-nudges-image2.webp'><br/></li><li><b>Past Close Date Nudges</b>: Informs users whether the deals have close dates that are in the past.<img style='max-width:420px;' alt='image1' src='https://assets.uiaas.io/web/aviso/blog/enhanced-nudges-image1.webp'><br/></li></ul> <p>Aviso’s AI-powered nudges are available in the form of timely email digests and mobile notifications containing pertinent revenue, activity and conversation insights.</p><p>We hope you will find this feature helpful. Do let us know if you face any issues or have any additional feedback/ suggestions by emailing us at <a href='mailto:support@aviso.com'>support@aviso.com</a>.</p>"
}
