{
	"content": "<p>Effective collaboration is key to any successful sales team. But it can be tough to get right. With so many free tools such as Zoom and Slack out there, it may seem like you don't need anything else. But at Aviso, sales and deal collaboration is much more than just meetings and live chat.</p><p>Aviso’s Deal Rooms help you work together as a team before, during, and after a deal is finalized. Aviso’s tools like chat messaging, file sharing, and integrations make it easy to communicate with each other without any need to flit back and forth between multiple tabs and browser windows. You can also use our native live audio and video conferencing tool to have virtual meetings.</p><br/><img src='https://assets.uiaas.io/web/aviso/blog/automatic-deal-creation-screen.webp' alt='Notification Center Image 1' /><br/><p>It’s a collaborative space for your revenue teams and other cross-functional team members to work together on boosting company revenue. It lets you close customer opportunities quickly by sharing critical deal details, status updates, and documents more efficiently.</p><p>However, creating a deal room manually for every deal is quite tedious for sales reps and sales teams. Your sales reps would probably groan at having yet another system to do admin work. Automatic creation of a collaboration channel for every deal will save you and your reps a lot of effort.</p><p>That's why Aviso offers Automatic Deal Room Creation, through which anyone involved in the deal can join, view, and engage in deal-related conversations and coaching. Automatic Deal Room Creation brings a lot of value to the table by allowing collaboration and deal visibility to all team members. It allows you to enable deal rooms automatically and include all the required deal stakeholders, collaborate on deal progress in real-time, manage all the necessary document workflow, and schedule meetings easily.</p><p>To navigate to Automatic Deal Rooms in Aviso,<ul><li>Select the Deals tab from the menu and click on any deal to enter into the deal card.</li><li>Then, select the “Deal Room” tab from the menu at the top, and click on “Join Deal Room” to enter the Deal Room for the particular deal.<br/><img src='https://assets.uiaas.io/web/aviso/blog/automatic-deal-room.gif' alt='Automatic deal room' /><br/></li></ul></p><p>Inside Aviso Deal rooms, your sales reps and managers can use AI insights on performance and have better coaching discussions for a longer-term impact. Your reps, managers, customer success, sales ops, finance, IT, and other executives can virtually collaborate across different time zones.</p><p>Do give our Collaboration Spaces a spin, and drop us a line at <a href='mailto:support@aviso.com'>support@aviso.com</a>, if you have any questions or suggestions.</p>"
}
