{
	"title": "Insights and Outlooks from Paul Chapman: Staying Resilient During a State of “Business as",

	"content": "<h2 ></h2>\nWe were delighted to sit down with <a href=\"https://www.linkedin.com/in/paulrchapman/\">Paul Chapman</a>, a highly experienced Sales and Revenue tech executive, to learn from his experiences on how to stay resilient when everything is business as unusual. Paul was formerly the CIO of HP Software at <a href=\"https://www.linkedin.com/company/hewlett-packard-enterprise/\">Hewlett Packard Enterprise</a> and is currently Global CIO at cloud content management and file-sharing company, <a href=\"https://www.linkedin.com/company/box/\">Box</a>. He recently joined the Aviso Advisory Board.\n\nWhile speaking with Paul, we were interested in learning about his insights and outlooks on the current state of business operations in this new remote world we’re living in. We were curious to pick his brain regarding his tremendous experience with collaboration software and a strong operations lens. Below, you’ll find various video snippets and their transcriptions of our conversation with Mr. Chapman as he shares the importance of technological adaptation, remote company culture, and business resiliency.\n\n<a href=\"https://youtu.be/IQrjgGV_Zmk\"><img class=\"size-full wp-image-9267 aligncenter\" src=\"https://assets.uiaas.io/web/aviso/blog/Paul-Chapman-1_-Business-as-Unsual.webp\" alt=\"\" width=\"896\" height=\"502\" /></a>\n\n&nbsp;\n\n<strong>Aviso: What do you see as the new normal, and how do you see the world look moving forward?</strong>\n\n<strong>Paul: </strong>There's no blueprint for the current situation. It's not like a lot of situations where we have some historical references or some rearview-mirror data that we can look at that allows us to predict where we're headed here. So, I think one of the key things is early on we all had to move very quickly to adjust to this working remote, which by the way seems such like a legacy conversation, now three-four months ago.\n\nWe've all learned a tremendous amount in the past few months. I think now that we've transitioned to working remotely, for the most part successfully, the conversations have now really shifted to your point of “what does the future new normal or business as unusual look like?” I do believe we're going to come out of this with a much stronger way of working globally. I've spent the last few months talking to and being involved in literally hundreds of technology leader interactions and conversations.\n\nCertainly a few things have emerged that I think are relatively consistent. I think one of those is around what's happening to technology budgets and investments. I think major projects, ERP upgrades, and large enterprise-systems implementations have slowed down, been paused, or canceled. COVID for sure has accelerated the digital agenda and digital transformation efforts across almost every industry.\n\nAnd certainly, it looks like as we go forward here, the remote workforce is here to stay certainly post-COVID. Our workforce is certainly going to be more virtual, collaborative, and tech-savvy in the future. I do think that every business process is now a target for automation. I think we're going to see, and we are seeing, a significant push for investments in accelerating digital architecture and business resiliency.\n\nIt's a great opportunity for technology leaders to have the courage to stand tall and accelerate digital agenda and transformation. And as we look forward, I think most organizations believe the re-entry will be gradual. It's certainly far more complex moving back than it was moving to remote work. I think we've proven we can work effectively in a remote way now.\n\nI think employees are wanting more flexible schedules. Productivity has generally gone up in most places. I think there's going to be a reluctance to rush back into the office, especially after mandatory self-quarantine is lifted. And we're dealing with such a patchwork quilt of government and state regulations and so on. I think building campuses are going to change. There's a lot of things that I think in the future, or business as unusual, that are going to be different, but I think we're going to learn a lot and they're going to be better.\n\n<a href=\"https://youtu.be/qM4bYKKA9do\"><img class=\"wp-image-9268 size-full aligncenter\" src=\"https://assets.uiaas.io/web/aviso/blog/Paul-Chapman-2_-Role-of-CIO-in-Remote-Work.webp\" alt=\"\" width=\"896\" height=\"502\" /></a>\n\n<strong>Aviso: How can CIOs work through their critical technology enablers to support remote work?</strong>\n\n<strong>Paul: </strong>I would caution on calling it extended remote work, I think it's here to stay. And I don't think it's around making short-term decisions, it's around making long-term decisions. I think that we're in the early stages here right now. And without an effective vaccine, we're going to be in this operating mode for quite some time. So, I think this is the opportunity to make the right investments that are actually the long-term investments.\n\nI think that as companies moved quickly and adopted, maybe new tools and new ways of working, the platforms of course that we saw had a dramatic increase in usage were services that supported any form of conversation exchange or collaboration and so on. Sort of that communication fabric for an organization. And of course, we've seen what's happened with services like Zoom, and WebEx, and Slack, and Teams. And even services like Box as well.\n\nWe've seen a significant increase in the adoption and usage of our platform for sharing, collaboration, and secure remote work. Email actually, surprisingly, and maybe I shouldn't say surprisingly, it's been around for 50 years, and I think people are still addicted to email. But I think that those are the base-level services that are now if you have those types of services in place, are proving to be extremely valuable.\n\nI think organizations that may have had a maybe a more legacy technology footprint struggled to transition. I think the one thing though that I would also caution is, of course, is that responding to a crisis like this does not mean security threats or compliant risks are any less pervasive. And in fact, we have seen it at Box and I know other technology leaders have as well, an uptake in COVID-19 malware attacks leveraging bogus news articles around COVID, malicious emails, and things like that.\n\nSo, the attack surface has changed. And I think that anytime we're thinking about new technologies and new services, we have to make sure we're thinking through our security architecture and building security in as we accelerate our digital agenda.\n\n<a href=\"https://youtu.be/l3OHVin5x7Y\"><img class=\"wp-image-9269 size-full aligncenter\" src=\"https://assets.uiaas.io/web/aviso/blog/Paul-Chapman-3_-Aviso-Advisor.webp\" alt=\"\" width=\"896\" height=\"502\" /></a>\n\n<strong>Aviso: What motivated you to join Aviso as a Board Advisor?</strong>\n\n<strong>Paul:</strong> As a technology leader, I gravitate towards being forward-thinking and innovative in nature. And that's something that I look for in other technologies and services and companies, even in their culture. Companies that are forward-thinking and innovative in the way they operate, the way they think, the way they behave, are very important to me. Because you can learn so much from partnering with organizations like that.\n\nAs I mentioned earlier, every business processing function is under pressure to automate more—specifically in sales. You want your sales team to be spending their most valuable time on the lifeblood of any organization which is your customers and generating revenue. You want them to be working on the highest value work and not spending time inside of CRM systems, staring at limited data sets, and trying to deduce actionable insights from that.\n\nYou don't want predictions and forecasting that's made from limited data sets, gut feel, finger in the air, generally siloed sets of data. And I think that with Aviso, you get to level the playing field. Aviso allows you to level the playing field. It allows you to look across a massive amount of data and deducing at an organizational level—I'll say at the CRO level.\n\nThrough AI, producing an accurate set of predictions and insights that you can then confidently rely on to make guided selling direction and actions. I think today we just have way too much data for humans to be able to work with effectively and efficiently, and they're just signals in the data that are just missed.\n\nAnd I think Aviso helps to find, I like to say, diamonds in the data, and provide guided selling that you can then be confident are the right ones. To me, the accuracy of prediction that you can then rely upon builds confidence and trust. I see that that is what Aviso is maniacally focused on, which is one of the reasons why I've been part of the advisory team there.\n\n<a href=\"https://youtu.be/xsHPVRt8O1s\"><img class=\"wp-image-9270 size-full aligncenter\" src=\"https://assets.uiaas.io/web/aviso/blog/Paul-Chapman-4_-Business-Resiliency.webp\" alt=\"\" width=\"896\" height=\"502\" /></a>\n\n<strong>Aviso: How to develop confidence beyond business continuity plans?</strong>\n\n<strong>Paul: </strong>I think we'll go back to what we mentioned earlier. When you think about legacy, and legacy ways of thinking, legacy ways of operating; if you haven't invested in modernizing your architecture and your services and the way that you operate, then you are now under extreme pressure to accelerate that digital agenda. And I think that includes the notion of what was more of a legacy way of operating, which was building a business continuity plan.\n\nAnd I've always found that business continuity plans are almost like the three-ring binder: here's our plan, we tabletop exercise what might happen if there was an earthquake on the West Coast of the United States and we lost power or a data center, or if there's an Eastern seaboard event that takes out…(a Hurricane Sandy sort of thing). But nothing really accounts for resiliency to a massive global disruption, which is what we're having now.\n\nAnd so, the switch from thinking about business continuity being this plan that you execute on, hopefully you never need it but if you do you have a plan that you can execute on, versus operating with business resiliency on an ongoing basis. I think now, this is proving out to be even more important because, without an effective therapy or vaccine over the next 9, 12, 18, 24 months, I think we could see rolling shutdowns happening on a frequent basis. We could see waves for the foreseeable future.\n\nSo how do we make sure that the next time this happens this is not an event, but it's business as usual or business as unusual depending on how we use that phrase? I think now is the time to push for investments in accelerating the digital architectures.\n\nInvesting in business resiliency so that our operations are resilient, our processes are resilient, our systems are resilient. It's somewhat business as usual when massive disruption happens. Of course, a lot of cloud services are built to be resilient—they have resiliency built in. They've always been sort of location agnostic.\n\nI always used to say, ‘work is a state of mind, not a place.’ Although these days, it is a place; it's our home environment. So, I would say that the way to think about this is: business resiliency is a way of operating on an ongoing basis versus business continuity is something that is preparing for an event to happen.\n\n<a href=\"https://youtu.be/2aO_-q1a_nw\"><img class=\"wp-image-9271 size-full aligncenter\" src=\"https://assets.uiaas.io/web/aviso/blog/Paul-Chapman-5_-Company-Culture.webp\" alt=\"\" width=\"896\" height=\"502\" /></a>\n\n<strong>Aviso: How to adapt to work from anywhere?</strong>\n\n<strong>Paul: </strong>This is an extremely important topic because I think sometimes, we can get a bit consumed with technology conversations. But when you look at the culture and the emotional side of things, and the employee well-being side of things, some companies are nervous. They haven't grown up in what you would call a ‘work from anywhere’ style.\n\nAt Box, our ethos from day one has always been building environments that takes the work out of work, which allows for frictionless employee experiences to work from anywhere, any place, any time. That's been in our DNA from day one. And so, the environment is somewhat purpose-built for this type of situation. Some groups are more apt to transition than others. You can speed up some things but you cannot speed up the culture of work from anywhere.\n\nWhat could take, previously, several years to roll out at a comfortable pace, now, in certain investments in technology, are now forced into days and weeks. If you don't have a culture of adopting change at an accelerated pace or even just working in a different environment, that can be hard for a lot of organizations.\n\nI think if you pop it up a level from there and you just think about just leadership in general, this is a time to lead with empathy and compassion. It's crucial that we do that. It's key to be socially connected while physically distant from each other. We need to have open and intentional communication with our teams and our employees. We have to be thinking about employees that might be living alone.\n\nRemember to pay extra attention to people who may live alone or maybe a little bit more isolated. We have to do more emotional sharing. I've seen everything from the virtual coffee hours to taking meetings on Peloton bikes to cooking classes and yoga online. At Box, we have a wellness portal for fitness challenges, personal wellness goals, and health assessments. We use an app called Headspace, which is a mindfulness app. It helps with guided meditation and tips and practices on sleep and exercise and things like that.\n\nSo, no one's working 9-5 anymore. We've seen a flattening of the workday. We have a lot of data actually at Box that shows the usage of working patterns or how people are working.\n\nWe've seen a flattening of the working day where people are starting to work earlier in the day. Maybe that's because they don't have the drudge of the commute at the beginning or end of the day. We're seeing people work later in the day. We're seeing a softening around the middle of the day. I don't think there's going to be a single day where it's like okay, COVID is done.\n\nSo, we have to make sure that from a leadership and an empathy perspective, our message from day one was: we want our employees to take care of themselves, take care of their families, and then the work will take care of itself from there. So, definitely leading with empathy and thinking about the culture is extremely important at a time like this.\n\n<a href=\"https://youtu.be/DhlHicOTrU0\"><img class=\"wp-image-9272 size-full aligncenter\" src=\"https://assets.uiaas.io/web/aviso/blog/Paul-Chapman-6_-Next-10-Years-of-SaaS.webp\" alt=\"\" width=\"896\" height=\"502\" /></a>\n\n<strong>Aviso: What are the new technologies you believe will be adopted in the next 10 years?</strong>\n\n<strong>Paul: </strong>I feel like a lot of the technologies that we need, or are going to need, are already in some fashion available to us today. Maybe a little more embryonic in others than other places. I think what will happen is not necessarily lots and lots of new technologies, but an acceleration of the adoption and the growth in the enhancements of capabilities of those technologies.\n\nSo, as an example, where you look at companies that provide simulation software for providing what feels like a conference room experience, whiteboarding, collaboration software, and things like that. Software that's been around for a while, but unless you have mass work remote may have been used marginally for some remotely distributed teams, unless you're already in it working as a remote organization.\n\nJust as a side note, I read a book this past weekend that was titled, “Remote: No Office Required” written by a gentleman by the name of Jason Fried. It was written in 2015, interestingly enough, and shared a lot of experiences about the value and the benefits of working remotely and some of the challenges and how to overcome those challenges.\n\nIt was almost like a prediction for what was going to happen in 2020. But what you see is people are now adopting tools and capabilities that they already had, but they're adopting them at a much more sophisticated level and an accelerated pace. I think it's like Zoom; it didn't get invented during COVID, it was around pre-COVID. Now we're seeing just a massive adoption there. We're seeing a lot of that.\n\nTo your point that we mentioned earlier around culture as well, I think we also have to make sure we focus on: business models are being disrupted, operations are being disrupted, technology architecture is being disrupted, and the culture of a lot of companies is being disrupted.\n\nYou mentioned the last 10 years, if you go back, I think statistics show or data shows that 55+% of the Fortune 500s have disappeared since the year 2000. Which if you do the math is more than one per month. When you look at ‘why?’, it was not because of technology. Technology was the enabler to the disruption, it was the enabler to the outcome.\n\nAnd that is now potentially being sped up even more with COVID. So, now COVID being the new champion of accelerating change or digital agenda for most companies. So, I think you're going to see a rise in software platforms that enable teams to collaborate better, simulate office experiences, whiteboarding, scrum meetings, software development, automated QA.\n\nI've been talking to some companies recently that are automating their security validations, compliance validation, automation of QA, bringing together in single dashboards for telemetry for what's going on across your organization, and measuring productivity. Things that are built for global teams to design, collaborate, and build more effectively. I think you're going to see a lot of things there.\n\nAnd of course, we're going to see a continued rise in leveraging machine learning and AI. I like to say that if any activity that takes a human being less than a second to think about can be automated. Doesn't mean to say it has been, but it can be. Think about the digital transients of today, versus the digital natives of today. They're entering the workforce with an entirely different set of expectations, a different way of working, a different way of thinking. They are much more apt to change and are not going to necessarily accept ways of working that were pre-COVID—things that are maybe standard, repeatable, mundane types of work.\n\nWe have to introduce digital labor, we have to introduce AI, we have to introduce machine learning. Otherwise, it's going to be really hard for us to even attract the new generation of workforce that's coming.\n\n<a href=\"https://youtu.be/3l9OBPTQiC8\"><img class=\"wp-image-9273 size-full aligncenter\" src=\"https://assets.uiaas.io/web/aviso/blog/Paul-Chapman-7_-Best-Practices-for-CXOs.webp\" alt=\"\" width=\"896\" height=\"502\" /></a>\n\n<strong>Aviso: What advice do you have for new COVID hardened CXOs?</strong>\n\n<strong>Paul: </strong>Well, there's a lot packed into that question. You now have struck a new term for me here. We always talk about millennials as a generation: Gen Z, Gen Y, Gen X. Now we have maybe a COVID generation, post-COVID generation. It will be very interesting to see pre and post, whether or not we consider that a generation of workforce that went through this and what did we learn?\n\nI truly believe and this is one of the things that I really enjoy about the technology community or technology leadership community and more broadly, is the willingness to share and collaborate on feedback and learning and experiences which is the wisdom of our communities, how we all learn more. I often say the slowest rate of change we will ever experience is the one we are experiencing now.\n\nI think COVID is putting that to the test for sure. It's certainly not slowing down anytime soon. I often tell my organization; you have to get comfortable with being uncomfortable. I often say; the pain of change is mandatory, it's the suffering that’s optional, and if you don't like change, you’ll like irrelevance even less.\n\nAnd I think as technology leaders, you have to reinvent yourself many times over to stay relevant and, in some ways, you're battle-tested for another transition here at an accelerated pace. I think that we will find that there are different ways of working more efficiently, more effectively. I've heard a lot of people saying that productivity has gone up in general for the most part.\n\nSometimes the work and personal sort of blends together a little bit. But people are generally feeling more productive. There are little things I just found out recently called ‘speedy meetings’, because meetings generally tend to start and end on time in this remote world that we're working in. As an example, I can disconnect from one Zoom meeting and immediately connect to the next one with no decompression time, just literally switch.\n\nContext switching is actually the harder part, not the technology, switching between meetings. There's this capability that’s called ‘speedy meetings’, whether you use Google for calendaring or Outlook, they both have this where anytime you set up a meeting for 30 minutes, the default changes it to 25 minutes. If you set up a meeting for 60 minutes, it sets it to 50 minutes.\n\nAnd because meetings generally are starting and ending on time, you don't have this five minutes in between meetings where people are running around buildings, going upstairs, elevators, running by the kitchen, grabbing something to eat, or whatever, and starting most meetings five minutes late.\n\nThis is actually allowing you to not only have meetings that are effective but also the playing field is being leveled in terms of an equalizer. Everybody is on the same platform. You don't have half the people dialing in to a meeting or video-ing in and half the people in the conference room.\n\nWe're finding that the participation of online and virtual, same with conferences, all-hands meetings, team meetings, one on one meetings, and the engagement has been significantly going up as well. We have to find ways to make sure that we do have these decompression times built into our working day. I think we're going to learn a lot of new and better ways to work that are in that area.",
	"slug": "insights-and-outlooks-from-paul-chapman-staying-resilient-during-a-state-of-business-as-unusual",
	"author": "Michael Dewar",
	"categories": ["Interview Series"],
	"pub_date": "9/1/20",
	"pub_time": "2:00 PM",
	"description": "An interview with Paul Chapman on remote technologies, business resilency during COVID, working from home company culture, and business continuity plans."
}
