{
	"content": "<div class='uk-flex uk-flex-middle'><img  class='uk-border-circle uk-box-shadow-large uk-border uk-height-small uk-margin-right uk-background-secondary' alt='Lori Harmon' src='https://assets.uiaas.io/web/aviso/lori_harmon_nobg.webp' /><span class='uk-text-middle'><div class='uk-h4 uk-margin-remove-bottom'>Lori Harmon</div> VP of Global Renewals & Virtual Sales, NetApp</span></div><p>As part of Aviso's Revenue Navigators Series, we spoke with <a target='_blank' href='https://www.linkedin.com/in/lorilharmon/&amp;sa=D&amp;source=editors&amp;ust=1649875327848269&amp;usg=AOvVaw3iVlqZiuMbJ2p2dozTQpsr'>Lori Harmon</a>, the VP of Global Renewals & Virtual Sales of NetApp. Lori currently oversees 2 billion in P&amp;L and is a leader in digitalizing the customer's sales journey. Headquartered in San Jose, CA, with over 10,500 employees, NetApp provides hybrid cloud data services and data management solutions. This post is the first of three segments breaking down Lori's interview with Aviso. We had the opportunity to hear about the critical inflection points of Lori's career journey, the importance of women leaders and diversity in technology, as well as an insight into her contributions to <a target='_blank' href='https://www.netapp.com/social-impact/netapp-serves/&amp;sa=D&amp;source=editors&amp;ust=1649875327848597&amp;usg=AOvVaw2o59qOqFM2svmJJaUbQdB3'>NetApp Serves</a>.</p><p class='uk-h4'>Aviso: You've had a distinguished revenue leadership career in technology. Can you share your career journey and the key inflection points with us?</p><p><b>Lori Harmon:</b> One of the major inflection points of my career was when I got the opportunity to lead an initial inside sales team for Network General. I had the opportunity to work in inside sales before it was a well-established field or familiar concept. I faced some struggles to get representatives on board. However, I embraced this challenge and built a solid and well-respected inside sales organization. We were able to go from zero to 50 million in two years, and by six months in, we had people in the field standing up, giving testimonials about how great it was to have inside sales as a partnership.</p><p>By the end of this pioneering age, the technology industry began to truly embrace inside sales as an essential part of a company's revenue success journey. About three years ago, I joined NetApp and assisted in the company's growth from a multi-million dollar company to a billion-dollar company. Through my position at NetApp, I have continued my career journey of leading a large sales organization.</p><p class='uk-h4'>Aviso: What role do you see women leaders playing in organizational transformation and driving growth?</p><p><b>Lori Harmon:</b> In addition to being the VP of Global Renewals & Virtual Sales at NetApp, I serve as the Global Chairwoman for Women in Technology at NetApp. Being a woman in business is important to me. I am trying to educate others on the importance of having a diverse workforce and leadership team, which is key for companies to be successful. Research demonstrates that having a diverse workforce helps a company increase revenue, drive profitability, and be more innovative. Without embracing diversity in the workplace, companies are likely to lose their competitive edge.</p><p>I also mentor young women in their early careers to help them grow into future tech leaders. Being a woman in technology, I really enjoy mentoring other women who are early in their careers because I want to see them grow and develop, and ideally, get promoted and move up in their careers, because they're successful. As technology companies continue to embrace workforce and leadership diversity as a tool, they become more agile, innovative, and successful.</p><p class='uk-h4'>Aviso: What volunteering and community opportunities are you excited about? Can you share more about NetApp Serves?</p><p><b>Lori Harmon:</b> Outside of work, I am passionate about helping communities through volunteering. In November 2021, I participated in a service event, 'Cooking in the Cloud Contest,' put together by NetApp Serves. 'Cooking in the Cloud' is an annual event that supports hunger programs through contributions from NetApp employees. In 2021, we raised $47,000 for donations. While it was a fun cooking competition, it was not about doing it to win; it was to help for the good of the program. These kinds of philanthropic initiatives bring together thousands of company employees to support the common good and make a difference in struggling communities worldwide.</p><p class='uk-h4'>Conclusion</p><p>In her career journey, Lori Harmon pioneered how technology industries viewed inside sales. Her time spent building strong sales teams, diversifying workforces, and mentoring young women, shows her dedication to the growth and success of talent in the technology industry. As a leader of Women in Technology and a volunteer in NetApp Serves, she sets an example for corporate leaders to give back to their communities.</p><p>In Lori Harmon's upcoming segment of Aviso's Revenue Navigator Series, we will dive into the process of developing a digitized sales team with the essential role of conversational intelligence.</p><p>If you are interested in following NetApp's decision to go with Aviso's single pane of glass, please sign up <a href='/contact&amp;sa=D&amp;source=editors&amp;ust=1649875327851714&amp;usg=AOvVaw3aFFuSTF8p_hHKQHuqIlaa'>here</a>. You can also read other customers' success stories <a href='/customers&amp;sa=D&amp;source=editors&amp;ust=1649875327851967&amp;usg=AOvVaw0Zi95dHHETCksJsWQgzMQH'>here</a>.</p>"
}
