{
	"content": "<div class='uk-flex uk-flex-middle'><img  class='uk-border-circle uk-box-shadow-large uk-border uk-height-small uk-margin-right uk-background-secondary' alt='Lori Harmon' src='https://assets.uiaas.io/web/aviso/lori_harmon_nobg.webp' /><span class='uk-text-middle'><div class='uk-h4 uk-margin-remove-bottom'>Lori Harmon</div> VP of Global Renewals & Virtual Sales, NetApp</span></div><p>As part of Aviso's Revenue Navigators Series, we spoke with <a target='_blank' href='https://www.linkedin.com/in/lorilharmon/&amp;sa=D&amp;source=editors&amp;ust=1649875327848269&amp;usg=AOvVaw3iVlqZiuMbJ2p2dozTQpsr'>Lori Harmon</a>, the VP of Global Renewals & Virtual Sales of NetApp. Lori currently oversees 2 billion in P&amp;L and is a leader in digitalizing the customer's sales journey. Headquartered in San Jose, CA, with over 10,500 employees, NetApp provides hybrid cloud data services and data management solutions. This post is the second of three segments breaking down Lori’s interview with Aviso. NetApp searched for a CRM tool that would improve their customer engagement, internal training, and growth of sales teams. As a leader in digitalizing the customer’s sales journey, Lori spoke out about the importance of conversational intelligence for the collaboration and development of sales teams across industries.</p><p class='uk-h4'>Aviso: How does conversational intelligence change the game for sales teams in the remote, digital world?</p><p><b>Lori Harmon:</b> As the pandemic began to spread across the globe in March 2020, I had to quickly enable my sales team at NetApp to operate virtually while also adjusting to a brand new CRM system. In a remote work environment, people move around. How do you get them ramped up more quickly? How do you make that happen without getting those insights and having that Intelligence? In this new environment or the ‘new normal’, I definitely see conversational intelligence becoming a lot more popular and necessary for sales leaders going forward.</p><p>As a remote manager, there is an issue with the visibility of your team. Conversational intelligence powered by Aviso AI allows sales managers to manage and coach sales reps in a virtual environment. Managers are able to find areas of improvement and refine their skills. Through the process of reviewing meeting recordings and transcripts, both sales teams and their customers can enhance their communication and collaboration skills. Conversational intelligence is used as a vital tool for growth and profitability, and to recognize positive sales performance in a virtual team environment.</p><p class='uk-h4'>Aviso: How essential is conversational intelligence to drive better sales outcomes and help reps in their careers?</p><p><b>Lori Harmon:</b> Conversational intelligence helps sales teams become efficient with insights such as where it is best to spend time, where to focus, how to answer the client question in real-time, and which deal has the highest probability of success. These insights are critical in driving better sales outcomes.</p><p>In NetApp, it is essential for sales managers to accurately identify specific growth areas of sales reps, help them be more productive, and reach higher sales numbers. Conversational intelligence is that X-Ray machine to see what is happening within the sales organization. The purpose of using CI CRM is not to micromanage people. The intent is to help the organization and the reps to be more successful. So, if you embrace it in a way that will help people to do their jobs better, you can learn [valuable information] through CI. This results in increased manager visibility with specific insights for the advancement of your sales representatives. CI technology ultimately helps reps on an individual level while improving the numbers of your team overall.</p><p class='uk-h4'>Aviso: How has Aviso AI helped you digitize your sales teams for Global Digital, Virtual, and Renewal Sales teams?</p><p><b>Lori Harmon:</b> Through Aviso, NetApp had the opportunity to identify growth points for essential functions across the company, be it partner channels, deal rooms, or seller improvement. The key was conversational intelligence. We could look at calls that our reps were doing with customers, channel partners, or even some of our sellers and learn from those calls because, of course, everything is digitized immediately, which is great. Aviso was then utilized to discover where our clients might be confused about a product or service during a sales call or meeting from a customer-specific focus.</p><p>With Aviso’s conversational intelligence, keywords are used to find customer objections, buyer intent, and product education and clarification possibilities. The use of activity mapping is vital to discover where customers are best responding and how NetApp can give them the highest level of engagement. It’s important to understand how engaged, especially in a success role, your customers or partners are with what you’re doing because it’s hard to be or help them be successful if there’s no engagement.</p><p class='uk-h4'>Conclusion</p><p>In this interview segment, Lori Harmon spoke about how conversational intelligence and AI-generated insights empower sales representatives to grow and advance their careers. In a virtual business environment, successfully maintaining visibility, communication, and collaboration with your sales team requires intelligence tools. Aviso’s AI platform uses keywords and topics to uncover essential customer and sales rep statistics, scores, and insights. This enables managers to utilize specific nudges in their decision-making process to improve their team’s performance and maximize the company's profitability.</p><p>If you are interested in following NetApp's decision to go with Aviso's single pane of glass, please sign up <a href='/contact&amp;sa=D&amp;source=editors&amp;ust=1649875327851714&amp;usg=AOvVaw3aFFuSTF8p_hHKQHuqIlaa'>here</a>. You can also read other customers' success stories <a href='/customers&amp;sa=D&amp;source=editors&amp;ust=1649875327851967&amp;usg=AOvVaw0Zi95dHHETCksJsWQgzMQH'>here</a>.</p>"
}
