{
	"content": "<div class='uk-flex uk-flex-middle'><img  class='uk-border-circle uk-box-shadow-large uk-border uk-height-small uk-margin-right uk-background-secondary' alt='Lori Harmon' src='https://assets.uiaas.io/web/aviso/lori_harmon_nobg.webp' /><span class='uk-text-middle'><div class='uk-h4 uk-margin-remove-bottom'>Lori Harmon</div> VP of Global Renewals & Virtual Sales, NetApp</span></div><p>As part of Aviso's <b>Revenue Navigators Series</b>, we spoke with <a target='_blank' href='https://www.linkedin.com/in/lorilharmon/&amp;sa=D&amp;source=editors&amp;ust=1649875327848269&amp;usg=AOvVaw3iVlqZiuMbJ2p2dozTQpsr'>Lori Harmon</a>, the VP of Global Renewals & Virtual Sales of NetApp. Headquartered in San Jose, CA, with over 10,500 employees, NetApp provides hybrid cloud data services and data management solutions. This post is the final segment of a three-part series breaking down Lori's interview with Aviso. NetApp searched for a CRM tool that would help better their customer engagement, internal training, and growth of their sales representative teams. They were looking for a technology to eliminate unnecessary single-use tools while being efficient and flexible with disparate data sources. This final post will dive deep into Lori Harmon's perspective of NetApp's gains from using Aviso's AI solutions.</p><p class='uk-h4'>Aviso: How does Aviso help CFOs and CROs as an integrated and guided revenue intelligence platform that replaces point products?</p><p><b>Lori Harmon:</b> One of the key values Aviso adds is having a single integration platform with a ton of functionality that could replace other point products companies have.</p><p>For NetApp and me, what stood out about Aviso is its single platform with multiple tools, allowing for a streamlined data integration across many sources. Managing too many revenue tracking and success tools is inefficient, time-consuming, and costly. Having a platform, like Aviso, that does conversational intelligence, activity mapping, customer engagement, AI-based forecasting, and the next best steps is like having three or four point products, all brought into one platform. This 'single pane of glass' technology allows companies to reduce CRM costs due to fewer products necessary to complete the same tasks.</p><p>Another attractive feature was the speed at which NetApp benefited from Aviso's solutions. Once implemented, it's a matter of weeks before you can get to 98% accuracy. Aviso's products can quickly output accurate data and forecasting without a rep needing to clean up years' worth of disparate data sources. Aviso allows sales teams to spend their time working directly with customers and focusing on closing deals based on the opportunity insights provided on the platform. This short adjustment period and data flexibility are essential for delivering a competitive edge in a fast-paced business landscape for the modern software firm.</p><p class='uk-h4'>Aviso: How does conversational intelligence help with handling objections?</p><p><b>Lori Harmon:</b> A large part of NetApp's need for a CRM conversational intelligence technology is due to the difficulty of manually pinpointing where a customer is unsure or has an objection about a company policy, product concern, or specific approach. Aviso's conversational intelligence technology could easily find and address complaints before they became a genuine customer concern.</p><p>This was also the opportunity to educate sales reps so the objection wouldn't be there in the future. We definitely learned a lot from looking at those objections.</p><p class='uk-h4'>Aviso: What is the potential of conversational intelligence for channel partners?</p><p><b>Lori Harmon:</b> Conversational intelligence can be used as leverage and justification when dealing with channel partners. Aviso can analyze meeting recordings and use CI to generate insights, opportunities, requests, weaknesses, or confusion that may exist within a deal, partnership, or organization. Discovering keywords and objections is essential for integration teams to know what needs to be provided, clarified, or changed to maintain a business relationship successfully.</p><p class='uk-h4'>What applications of AI for revenue are you most excited about in 2022?</p><p><b>Lori Harmon:</b> One exciting feature will be a sales enablement platform that allows for cadence management of people in diversified roles across a company. Another upcoming feature will likely be sending video clips to replace written emails. Video is pretty hot these days. So being able to record a video and send it out to your customer, who's already burnt out on email, can watch a quick clip instead. That's the kind of thing that can improve your conversation rate for leads and closing opportunities. So, that's something I'm excited about.Finally, I have already seen a feature across the software industry — AI management of install bases. Automating the process of communication between a distributor and their partner is an opportunity to quickly check the status of a deal, protect confidential information, and streamline the installation process. With these install base management platforms — a really cool technology that people will invest in — to get more out of the customers they have already sold to.</p><p class='uk-h4'>Conclusion</p><p>In this final segment of Lori Harmon's edition on the Aviso Revenue Navigators Series, she discussed how Aviso stands out as a CRM product in an industry with many technology solutions. As mentioned, one of the many distinguishing qualities of Aviso is its ability to move away from traditional single-use CRM tools to a centralized platform for sales rep success, revenue forecasting, and customer management. The future of revenue and conversational artificial intelligence applications is boundless, and we are excited to see the number of features grow in 2022.</p><p>If you are interested in following NetApp's decision to go with Aviso's single pane of glass, please sign up <a href='/contact&amp;sa=D&amp;source=editors&amp;ust=1649875327851714&amp;usg=AOvVaw3aFFuSTF8p_hHKQHuqIlaa'>here</a>. You can also read other customers' success stories <a href='/customers&amp;sa=D&amp;source=editors&amp;ust=1649875327851967&amp;usg=AOvVaw0Zi95dHHETCksJsWQgzMQH'>here</a>.</p>"
}
