{
	"title": "New Product Update: Informed Editing",

	"content": "<strong>Automate and De-risk Your Forecasting Entry</strong>\n\nTraditional sales forecasting methods come with a lot of inherent biases and problems. Perhaps the most seemingly innocuous of these has potentially the most devastating effect on the end calculations: typos. By this we are referring to, say, that accidental slip of the hand where 100M total pipeline is actually supposed to be 10M total pipeline.\n\nThe sales forecasting incumbents, spreadsheet products such as Excel and Google Sheets, are entirely based on manual entry of data. This makes them prone to extreme user error. In fact, on average, <a href=\"https://incisive.com/spreadsheet-error-horror-stories/\">88% of spreadsheets have errors</a> in them.\n\nLuckily, just by nature of Aviso using machine learning to automate your forecasting for you, spreadsheet errors are a thing of the past. Our newest product feature — “Informed Editing”— de-risks this process even further.\n\nNow, when you click in to edit a forecast judgment, Aviso informs you of the quarter you are editing in and whose forecast you are updating. When entering your judgment for a direct report you can see your ‘Start of Week’ judgment as well as your direct report’s current judgment.\n\nMoreover, there is no need to worry whether your changes have been saved thanks to “Submission Reassurance.” This means that you can submit your judgments with confidence. Once Aviso has registered your entry, we will display a green confirmation box as well as a friendly check box indicating that the update has been completed.\n\n<img class=\"size-full wp-image-8027 aligncenter\" src=\"https://assets.uiaas.io/web/aviso/blog/Informed-Editing-gif.webp\" alt=\"\" width=\"512\" height=\"317\" />",
	"slug": "new-product-update-informed-editing",
	"author": "Neha Nirkondar",
	"categories": ["AI for Sales"],
	"pub_date": "11/13/19",
	"pub_time": "2:56 PM",
	"description": "Aviso New Product Update: Informed Editing. AI-powered forecasts, deal accelerating insights, and 360-degree visibility into forecast data."
}
