{
	"title": "New Product Update: Contextual Nudges",

	"content": "<strong>Pulse Checks for Better Deal Execution:</strong>\n\nAs 2019 draws to a close, we are thrilled to announce Aviso’s newest product update: Contextual System of Nudges. With Aviso’s nudges, sales and go-to-market teams can better close the loop between forecasting and deal execution.\n\nNudges not only help prevent deal slippage by reminding users to act early and often, they also expedite deal execution by nudging different members of a sales team with insights and actions that matter most to moving a deal forward. In addition, nudges are customizable by the user or account administrator.\n\nIn Version 1.0, Aviso nudges will be available in the form of timed email digests, mobile notifications, and pertinent insights about deals a user is working on.\n\nBacked by our powerful auto-machine learning core, nudges are yet another way to get the most out of Aviso AI’s insights; with nudges, insights are curated and delivered directly to sales team members to update them about the state of deals and what actions they can take to drive business forward.\n\n<strong>Forecast Fill Nudge:</strong>\n\n<img class=\"wp-image-8068 aligncenter\" style=\"color: #456381;\" src=\"https://assets.uiaas.io/web/aviso/blog/Nudge-2_-Forecast-Update-1.webp\" alt=\"\" width=\"235\" height=\"469\" />\n\nAviso nudges act as reminders to update your forecast numbers without having to set your own reminders, or remind someone else to do so, or have your manager remind you!. This nudge is useful for individual reps and managers alike as it compels proactivity and timely deal-related action.\n\n<strong>Deal Activity Nudge: </strong>\n\nDeal Activity nudges help Aviso bring the most important activities to you and guide your next steps through deal nudges sent directly to your email.\n<p style=\"font-size: 16px;\"><img class=\"wp-image-8065 aligncenter\" src=\"https://assets.uiaas.io/web/aviso/blog/Nudge-1_-Deal-Alert-1.webp\" alt=\"\" width=\"248\" height=\"496\" /></p>\n<span style=\"text-decoration: underline;\">Deals At Risk:</span> Aviso can send you nudges about deals the AI has identified are at risk. This nudge contains key deal information and explanations that can help you take corrective action immediately, helping you rectify deal slippage before it’s too late.\n\n<img class=\"wp-image-8069 aligncenter\" src=\"https://assets.uiaas.io/web/aviso/blog/Nudge-3_-Deal-Alert-1.webp\" alt=\"\" width=\"237\" height=\"474\" />\n\n<span style=\"text-decoration: underline;\">Upside Deals:</span> Aviso can also send you nudges when it finds promising deals that are not in the forecast that the AI determines could be won this quarter. Our AI Research team has found that, on average, total deals won from upside deals is around 15%. Getting mobile and email nudges to take actions on these special deals is key to maximizing revenue attainment.",
	"slug": "new-product-update-nudges",
	"author": "Neha Nirkondar",
	"categories": ["AI for Sales"],
	"pub_date": "12/16/19",
	"pub_time": "10:37 AM",
	"description": "Aviso New Product Update: Contextual Nudges. AI-powered forecasts, deal accelerating insights, and 360-degree visibility into forecast data."
}
