{
	"title": "Aviso Named to Leader Quadrant by G2 Crowd",
	"content": "Every year the popular crowd sourced review site G2 Crowd releases their new grid reports for the year summarizing vendor positions in each respective software category. This year Aviso was fortunate enough to land in the Leader quadrant for the newly anointed Sales Analytics Category for 2018. Please feel free to read the <a href=\"http://www.aviso.com/G2-CROWD-LEADER\">report here</a>.\n\nUp until mid-February Aviso had been listed in the Sales Intelligence Category, which is a very broad category including roughly 60 data services vendors like LinkedIn, D&amp;B, DiscoverOrg, Datahug and InsideSales.com to name just a few. The rollout of the Sales Analytics category earlier in the year was a very welcome development for us as it’s a much more concise grouping of similar vendors focused on software, as defined by G2, that “leverages CRM and other data to reveal sales insights and forecast future performance.”\n\nMaking it into the Leader quadrant is dependent on two factors: customer satisfaction (based on user reviews) and scale (based on market share, vendor size and social impact). We excelled in both of these areas and were able to see a 300% increase in our reviews since late December. We view candid user feedback as a great tool to help us to stay in closer contact with our customers and get up to speed on any trending issues or input.\n\nWe take customer reviews and product feedback very seriously here at Aviso. We respond rapidly to every negative, and in some cases even positive, reviews to ensure we maintain a feedback loop and provide relevant, actionable feedback for our unbiased reviewers. In my few short months here at Aviso I’ve been impressed with the shared level of effort to quickly and collaboratively solve customer issues and I continue to be committed to working across all lines of business to strengthen these relationships.\n\nNowadays, just like the technology buying cycle, companies are educating themselves via digital platforms like G2 Crowd to become familiar with the leading vendors in each category and begin assessing vendor fit for their companies based on a number of important factors. To that end, these sites are becoming the de facto “one stop shop” for many leading companies to objectively evaluate tech vendors.\n\nIn case you missed it, here’s what our customers are saying about us:\n\n“Aviso's predictive forecast is deadly accurate for RingCentral's high transaction business.”\n\n“When we put in our target, we can see whether we are going to make it or not. Then we have 89 days to influence the number and make up any potential gaps.”\n\n“My favorite part of Aviso is the ability to drill down into the forecast and be able to see exactly what deals make up that forecast.”\n\n<a href=\"http://www.aviso.com/G2-CROWD-LEADER\">Read more here. </a>",
	"slug": "quadrant-leader",
	"author": "Editor",
	"categories": ["News", " Sales Analytics"],
	"pub_date": "4/4/18",
	"pub_time": "12:51 PM",
	"description": "Aviso named a leader in the sales analytics quadrant of G2 Crowd. Come see where we stand in the mix of vendors."
}
