{
	"content": "<iframe width='560' height='315' src='https://www.youtube.com/embed/f-3xIX7iv6E' title='YouTube video player' frameborder='0' allow='accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture' allowfullscreen></iframe><p>At one point or another, we have all had that nagging feeling in our gut that urges us to do something which we would rather not.</p><p>The world of sales is no different. Too often, deals get pushed out in a CRM. Predicting a close date is one of the most challenging aspects when it comes to accurate forecasting in sales. It is usually led by a rep's gut instinct and reps update Close Dates all the time in CRM. This is considered normal behavior in a sales process</p><h4>So what's wrong with believing that you have this uncanny intuition? Are there limits to it?</h4><p>Well, consider this: according to Gartner, by 2025, over 66% of B2B enterprise sales organizations will stop relying on intuition and instead rely on advanced data analytics, resulting in inaccurate forecasts, sales pipelines, and quota attainment.</p><p>Infact, Gartner goes further than that and says that in addition to the use of advanced data,  organizations can increase their chances of closing more deals, with \"AI-guided selling\". Such AI technologies can help generate win probabilities and insights so that sales teams can identify deals at risk and also the upside deals to help them close the gap.</p><p>There’s a thin line that separates trusting your intuition from making guesses that are deeply anchored in some subconscious biases.</p><p>Thankfully AI analysis shows clearly the risks of over trusting intuition on a matter that may seem simplistic on the surface - close dates - but that has a strong bearing on deal outcomes.</p><h2>THE CLOSE DATE IS THE CRUCIBLE</h2><h4>Is pushing out a deal a natural phenomenon - not in all circumstances!</h4><p>The close date may be pushed out because of reasons beyond our control, such as the decision-maker going out on leave or slow down due to procurement issues.</p><p>But most often deals are pushed because of reasons that are within our control - a sales rep may set unclear expectations, not engage with the buyer or they may simply have that \"Golden gut.\" This is where guided selling tools can help reps eliminate the guesswork out of the equation.</p><h2>RELATIONSHIP BETWEEN CLOSE DATE & WIN RATE</h2><h4>We analyzed data from thousands of deal characteristics across our vast customer database and looked at how close date movements and win rates are related</h4><p>If you think pushing out close dates isn’t a big deal, guess again.</p><cite>\"Your chance of winning a deal increases by 51% when there are no close date push-outs.\"</cite><p>Timely interventions are essential to ensure at-risk deals are closed before they become dead. You don’t want to inflate the size of your pipeline with dud pipeline deals that give you a false picture of future sales revenue. AI-based revenue intelligence can help reduce close date push-out and increase your likelihood of winning a deal.</p><br/><img src='https://assets.uiaas.io/web/aviso/winratecompare.webp' alt='win rate comparison'><br/><h2>THE FURTHER YOU DELAY, THE LESS LIKELY YOU'RE TO WIN</h2><p>Fluctuations are bound to occur in the likely close dates with the time consumed in finalizing deals. More and more interactions and involvement of more decision-makers do act as a retarding force on the Win rate</p><p>We looked at the extent of these fluctuations because what matters is not when and how many times a close date is changed, but rather the length of time in a particular stage.</p><cite>We found that the likelihood of winning a deal declines the further you push out the close date.</cite><p>Win rate for a deal vis-à-vis the average number of days the close dates fluctuate does have a strong relationship.</p><br/><img src='https://assets.uiaas.io/web/aviso/winratevsclosedate.webp' alt='win rate comparison'><br/><p>With these insights, you see that the deal that initially seemed promising doesn't seem very appealing anymore. This insight is paramount to confirm that you have a clear view of what's going on in your pipeline and that you can have an accurate forecast.</p><cite>Do you have these insights handy, if not? The good news is that you can easily and accurately understand the health of your opportunities.</cite><h2>HOW TO MAKE AI COMPLEMENT AND AUGMENT YOUR GOLDEN GUT</h2><p>AI based Revenue Intelligence solutions like Aviso can generate actionable Insights that sales teams can use to identify deals at risk and those deals with an upside potential to close earlier than forecasted.</p><p>Aviso AI helps automatically track critical sales activity data from various systems, including email, calendar, sales enablement tools, and more. This data is then visualized in a single pane for representatives and managers alike, giving the power to inspect the health of their deal in real-time.</p><ol class='uk-list uk-list-decimal'><li><b>What changed in this deal?</b> - Deal size goes up and down, and close dates get pushed in or out; change in forecast categories</li><li><b>How likely is this deal to close?</b> - WinScore, Aviso provides an AI-powered opportunity score based on historical data looking at factors involved in past closed won and closed lost deals.</li><li><b>What is the level of activity on this deal?</b> - Emails outbound/inbound, last email date, Aviso Activity, and CI Insights platform automatically pulls in data that is outside the CRM, like emails, calls, meetings, and more. It not only shows how many emails you're sending out, but how prospects are reciprocating, sentiment, objections raised, competitive mentions, etc.</li></ol><p>Aviso is also the only tool on the market to predict run rate business and provide forecast explanations from day one. Unlike the traditional forecasts which are tied to CRM hierarchy and not flexible to the needs of complex business hierarchies, AVISO's AI enables forecasting to be done with a complex flexible hierarchy to guide drill downs across businesses. Our forecasting blends the best of human and AI judgments with the most sophisticated global roll-up forecasting in the industry. </p><br/><p style='font-style:italic'>Interested in knowing how Aviso can help you drive more conversion and incremental growth? <a href='/contact'>Sign up</a> for a free consultation with our experts and we'll reach out to you.</p>"
}
