{
	"content": "<p>Notification centers have become the most engaging part of any product. Be it a mobile app or a web app, that’s the easiest way for users to see what’s important and understand what’s been happening with a particular account or deal.</p><p>Inside Aviso, the notification panel is a place to access alerts, notifications and shortcuts quickly. As seen below, you can navigate to Aviso’s notification panel by clicking on the bell icon on the top right of your screen.</p><br/><img src='https://assets.uiaas.io/web/aviso/blog/web-notification-center-image-1.webp' alt='Notification Center Image 1' /><br/><p>Aviso’s AI product notifications are of two types: Informational and Actionable.<ul><li>Informational product notifications provide on-the-fly revenue insights.<br/><img src='https://assets.uiaas.io/web/aviso/blog/web-notification-center-image-2.webp' alt='Notification Center Image 1' /><br/></li><li>Actionable notifications are accompanied by a nudge to perform an action.<br/><img src='https://assets.uiaas.io/web/aviso/blog/web-notification-center-image-3.webp' alt='Notification Center Image 3' /><br/></li></ul></p><p>All of the unread notifications will show up in the bell icon. If you want to see the newest or recent notifications, click on the bell icon to see all the unread notifications. Also, if you click on ‘View all Notifications’ you can see all the notifications received by a user.</p><img src='https://assets.uiaas.io/web/aviso/blog/web-notification-center-image-4.webp' alt='Notification Center Image 4' /><br/><p>If you want to mark them all as read or if you want to delete them, you have the option to select either all or the specific notifications.</p><img src='https://assets.uiaas.io/web/aviso/blog/web-notification-center-image-5.webp' alt='Notification Center Image 5' /><br/><p>Stay informed with Aviso’s Web Notifications, and drop us a line at  <a href='mailto:support@aviso.com'>support@aviso.com</a>, if you have any questions or suggestions.</p>"
}
