{
	"content": "<div class='uk-flex uk-flex-middle'><img  class='uk-border-circle uk-box-shadow-large uk-border uk-height-small uk-margin-right uk-background-secondary' alt='Scott McNealy' src='https://assets.uiaas.io/web/aviso/scott_mcnealy.webp' /><span class='uk-text-middle'><div class='uk-h4 uk-margin-remove-bottom'>Scott McNealy</div>CEO, Founder & Frontier-Thinker</span></div><p>As part of Aviso's Revenue Navigators Series, we spoke with <a target='_blank' href='https://www.linkedin.com/in/smcnealy/'>Scott McNealy</a>. Scott is a legendary Silicon Valley CEO, founder and frontier thinker. He is most famous for co-founding the computer technology company Sun Microsystems in 1982. Scott's leadership helped develop Sun into one of the world's leading computer companies. The success of the business rested upon his determination, business acumen, and ability to motivate those who worked around him.</p><p>This post is the first of two segments breaking down Scott’s interview with Aviso. As a revenue leader with extensive experience in selling and driving integration and alignment between all revenue-related functions, Scott spoke about how to balance sales with motivation and incentives, and how <a target='_blank' href='https://www.aviso.com/blog/aviso-ai-modern-solution-for-revenue-operations-and-intelligence'>revenue leaders can use AI-based technology</a> to maximize their opportunities in a changing environment.</p><p class='uk-h4'>Aviso: What is your advice to individuals just stepping into leadership roles in this environment?</p><p><b>Scott McNealy:</b> I've never seen so much uncertainty. I am glad that I am not CEO right now. We have an uncharted Bermuda triangle kind of opportunity heading towards us that I've never seen before. Everything is uncertain, and you don’t know what to believe. The inflation rate is uncertain, and we are encountering issues with the regulations, supply, and supply chain. The global uncertainty is just stunning. And so, every bit of data, any bit of forecast and any machine-learning kinds of activities that we can throw at it is important. We will have to make some sharp, quick moves. </p><p>If I were leading an organization today, I would be cautious about protecting my supply chain, but I would also be focused on being the most nimble. The more you can rent and the less you buy, the more you can subcontract and the less you own without sacrificing supply chain or quality, the better off you're going to be. It'll give you far more flexibility. Training your employees, customers, suppliers, and marketing will also be a huge issue. Technology will play a crucial role in <a href='https://www.aviso.com/blog/components-sales-enablement' target='_blank'>helping the entire sales process</a>.</p><p class='uk-h4'>Aviso: How does Aviso help decentralized GTM teams achieve their goals better and balance incentives?</p><p><b>Scott McNealy:</b> There are two sides to it. One, you must have firm control over the sales. This is where Aviso can give sales users the data needed to ensure that the numbers are accurate. On the other side, you need to make sure that somebody is keeping a check and balance on what the sales guys say because they will always push the envelope.</p><p>We never want to confuse selling with installing. I had sales guys on commission, but my tech support and the support engineers were on salary. And I always asked my support folks to tell the truth to the customers. By doing this, you get truth and accountability wrapped around the energy, enthusiasm, team building, and salesmanship of a salesperson. Aviso plays an important role in <a href='https://www.aviso.com/blog/aviso-ai-named-strong-performer-in-2022-forrester-wave-for-revenue-operations-and-intelligence' target='_blank'>bringing all these pieces together</a>.</p><p>Having a compensation structure where you have people assigned to ensure that the customers are getting the whole truth and not being sold is critical to turning your customers into your advocates.</p><p class='uk-h4'>Aviso: How would a crystal ball like Aviso have helped you when you were a CEO? How can revenue leaders use AI to win?</p><p><b>Scott McNealy:</b> AI gives an <a href='https://assets.uiaas.io/web/aviso/resources/Aviso-AI-Overview.pdf' target='_blank'> opportunity for revenue leaders</a> to learn from the vast data ocean of AI information out there. There’s so much data, so many transactions that need to happen to land a deal, and so many activities that need to be engaged. It’s difficult for the salesforce to gather all of this information on their own. AI can help find out where advertising is making a difference, where more tech-support engineers are making a difference, and which taglines are making a bigger difference.</p><p>A <a href='https://www.aviso.com/blog/feature-announcement-full-year-forecast-the-revenue-crystal-ball-your-gtm-teams-need' target='_blank'>crystal ball like Aviso</a> helps revenue leaders get insights into questions, such as what happens on the first week of the quarter versus the mid-week of the quarter or the last week of the quarter; what happens when you set goals; what happens with the sales rep in a particular environment, which sales rep is sandbagging, which accounts will make the quarter, etc.</p><p>No company ever went out of business for having too much business. So if I were the CEO, I would want to have the best tools to make my numbers. Nobody wants to go to the investors and say they missed the numbers. AI helps with being more predictable in achieving the numbers. This ensures that as a public company, your stock prices remain even, which is very important for morale. For private companies, this helps raise money from investors as they see that you are in control of your business.</p><p class='uk-h4'>Conclusion</p><p>While navigating a global pandemic and economic uncertainty that has impacted the way buyers engage with sales processes, sales leaders must remain nimble in how they lead their teams. AI-based technology is changing the way <a href='https://www.aviso.com/blog/how-to-use-ai-to-boost-business-confidence-in-a-vuca-world' target='_blank'>revenue leaders manage risk</a> and achieve growth.</p><p>In this interview segment, Scott McNealy spoke about how AI-based technology has enabled revenue leaders to make better decisions, understand customer behavior, and increase the efficiency of their marketing, sales, and operations teams. Scott also discussed how revenue leaders could use advanced analytical capabilities to overcome the challenges imposed by the current economic uncertainty and unlock new revenue streams.</p><p>Aviso AI is the all-in-one revenue operations platform. Aviso guides revenue teams with AI-powered deals, conversation, people, and activity Intelligence. By using Aviso, revenue teams can wade through the fog of <a href='https://www.aviso.com/blog/crm-tools-will-become-ineffective-soon-with-single-pane-of-glass-revenue-operations-and-intelligence' target='_blank'>outdated sales tech like CRM</a> and find their revenue true north.</p><p>If you are interested in knowing how Aviso can help you unlock your revenue potential with AI-based revenue intelligence, please sign up <a href='/contact'>here</a>. You can also read other customers' success stories <a href='/customers'>here</a>.</p>"
}
