{
	"content": "<div class='uk-flex uk-flex-middle'><img  class='uk-border-circle uk-box-shadow-large uk-border uk-height-small uk-margin-right uk-background-secondary' alt='Scott McNealy' src='https://assets.uiaas.io/web/aviso/scott_mcnealy.webp' /><span class='uk-text-middle'><div class='uk-h4 uk-margin-remove-bottom'>Scott McNealy</div>CEO, Founder & Frontier-Thinker</span></div><p>As part of Aviso's Revenue Navigators Series, we spoke with <a target='_blank' href='https://www.linkedin.com/in/smcnealy/'>Scott McNealy</a>. Scott is a legendary Silicon Valley CEO, founder and frontier thinker. He is most famous for co-founding the computer technology company Sun Microsystems in 1982. Scott's leadership helped develop Sun into one of the world's leading computer companies. The success of the business rested upon his determination, business acumen, and ability to motivate those who worked around him.</p><p>This post is the second of two segments breaking down Scott’s interview with Aviso. As a revenue leader with extensive experience in selling and driving integration and alignment between all revenue-related functions, Scott spoke about the current state of sales and what <a target='_blank' href='https://www.aviso.com/blog/an-overview-of-aviso-ai-sales-engagement-solution'>sales reps need to know</a> in order to succeed in today’s business world. </p><p class='uk-h4'>Aviso: In the world of Amazon and Costco’s data oceans, how can Aviso help all businesses use data to compete and sell better?</p><p><b>Scott McNealy:</b> Some really big changes have happened in retailing, sales, and even wholesaling. Every smash and grab video drives people to Amazon, Costco, or Walmart. The big winners have been Amazon; the big losers are the people with the big box — the mall centric kind of sales environment.</p><p>In this new world, small retailers and small brands are struggling. Market Consolidation is accelerating the decline of small businesses. The number of people who sell to Costco decides what's on the shelf. Amazon decides what pops up in your browser when you search on things. The Amazon search engines are probably more powerful than the Google search engine in deciding who's going to buy what. There is an interesting battle going on between the behemoths. </p><p>We have enormous amounts of data, and the big players are feeding their AI engines with data oceans, whereas the small retailers have a data puddle. Looking at these challenges shows that the role of sales is going to have to evolve. It will have to get smarter. It will have to get better at using data. And that's why I got all excited about Aviso and considered it worth an investment.</p><p>Aviso is on the right path, and it's moving us away from the Oligarch kind of environments that you get in with the current big tech players.</p><p class='uk-h4'>Aviso: How can sales reps do better education for digitally savvy well-informed prospects and customers?</p><p><b>Scott McNealy:</b> We need to have multimedia, on-demand, self-paced, active learning experiences for the customer. We call it marketing, and right now, a huge portion of marketing is Google, Facebook and Amazon. So how do you cut through all of that? You need to create an environment that's interesting, interactive, and a wonderful experience so that when you visit the customer, you have an already educated customer.</p><p>Nowadays, customers are bored with lean back kinds of experiences, YouTube videos, Vimeo, PDFs, web pages, etc. They want to interact and be able to ask questions. Whether you sell B2B or B2C, marketers and sales folks will have to learn to up their game by doing <a href='https://www.aviso.com/blog/how-ai-can-guide-your-digital-sales-coaching' target='_blank'>remote learning experiences</a>.</p><p class='uk-h4'>Aviso: As AI gets better, 5-10 years from now, what will an ideal sales rep look like?</p><p><b>Scott McNealy:</b> Sales reps are going to be very technically competent. It will be important to know what questions to ask of the data. Asking the wrong question will give you a useless answer but asking the right questions will provide you with the solutions that make a difference. That is where the world is headed in this big data and statistically significant world.</p><p class='uk-h4'>Aviso: What are your top Dos and Dont’s for modern sales reps?</p><p><b>Scott McNealy:</b> I'll tell you from a sales rep’s perspective, don't let your boss go into the sales call without having him briefed. You take control, you are the CEO of it, and you tell him what to say and what not to say. They won't always listen. That's why they're the boss. So, you have to make sure they're prepared.</p><p>Secondly, I tell every sales rep I run into that they never lose an order; it is only postponed. Every customer wants to have a backup. Even if you're a second place, deals aren't lost; they're just postponed. With this attitude, sales reps should <a href='https://www.aviso.com/blog/conversational-intelligence-the-reel-you-need-to-hook-and-loop-in-buyers' target='_blank'>stay close to the customer</a>. Always be there for the customers, don't get mad at them and give them the surety that their issues will be resolved.</p><p>The next thing I would tell you is that sales is very simple. Every time a customer gives you ‘no’ for an answer, ask them <a href='https://www.aviso.com/blog/handling-sales-objection' target='_blank'>the reason</a> for that and fix it. If you are a good sales rep, you'll go back and get your team to fix it. Be persistent in fixing this infinite ‘why’ loop. This shows that you are focused on taking care of things.</p><p>Lastly, too many sales reps don't want to sell their own employees on a mission. It is incredibly important to know everybody inside your organization. You don't go run it up to the CEO and then run it back down to the manufacturing. That will never happen. You must network at work. All the work happens at the individual level — the contributor, the engineer, the tech support guy, the sales guy, and the accountant. Be fun around people, not without the seriousness of purpose. Be the type of person who enjoys the economic experience of making a difference in the world.</p><p class='uk-h4'>Conclusion</p><p>The field of sales is at a turning point in its growth trajectory. Clients expect better services, lower prices, tailored experience, and personalized communications. Sales reps have to rely on lots of data and analysis to make better decisions about turning prospects into customers and expanding accounts. By applying AI and automation to the sales process, sales teams are gaining traction with their target audiences at rates never before seen.</p><p>In this interview segment, Scott McNealy spoke about how <a href='https://www.aviso.com/blog/how-ai-will-guide-corporations-part-1' target='_blank'>AI-powered selling</a> can help organizations compete with big market players, deliver superior customer experiences, and drive sales performance improvements. Scott also discussed some tips on what reps definitely should and definitely shouldn’t do in sales.</p><p>Aviso is the AI compass that guides sales and go-to-market teams to close more deals, accelerate growth, and find their revenue true north. <a href='https://www.aviso.com/blog/aviso-ai-named-strong-performer-in-2022-forrester-wave-for-revenue-operations-and-intelligence' target='_blank'>Aviso AI</a> delivers revenue intelligence, drives informed team-wide actions and course corrections and gives precise guidance, so sellers and teams don’t get lost in the <a href='https://www.aviso.com/blog/crm-tools-will-become-ineffective-soon-with-single-pane-of-glass-revenue-operations-and-intelligence' target='_blank'>fog of CRM</a> and augment themselves with predictive AI.</p><p>If you are interested in knowing how Aviso can help you unlock your revenue potential with AI-based revenue intelligence, please sign up <a href='/contact'>here</a>. You can also read other customers' success stories <a href='/customers'>here</a>.</p>"
}
