{
	"content": "<div class='uk-flex uk-flex-middle'><img  class='uk-border-circle uk-box-shadow-large uk-border uk-height-small uk-margin-right uk-background-secondary' alt='Simon Davies' src='https://assets.uiaas.io/web/aviso/simon_davies_nobg.webp' /><span class='uk-text-middle'><div class='uk-h4 uk-margin-remove-bottom'>Simon Davies</div>SVP & GM APAC, Splunk</span></div><p>As part of Aviso's <b>Revenue Navigators Series</b>, we spoke with <a target='_blank' href='https://www.linkedin.com/in/scdavies/'>Simon Davies</a>, the SVP & GM APAC of Splunk. Headquartered in San Francisco, CA, with over 7,500 employees, Splunk is the data platform leader for security and observability.This post is the first of three segments breaking down Simon’s interview with Aviso. As a business leader with extensive experience in selling and implementing IT solutions, Simon spoke out about how CRM has evolved over the years, the importance of the time-series approach to data, and how Aviso provides sales leaders with insights and best practices used by thousands of successful sales teams.</p><p class='uk-h4'>Aviso: How would you describe the evolution of CRM systems and their role in the future?</p><p><b>Simon Davies:</b> When I was at Oracle, the company acquired Siebel. It is a really cool reporting tool but not something that added much value to my work as an inside salesperson. And CRM platforms like Salesforce and Microsoft Dynamics are good for more advanced users who need complex features such as managing large databases of contacts rather than just basic things like remembering which customer owes you money.</p><p>With the help of AI, we can now use our customer data to help sellers what actions will get them through a sales cycle and onto their next one. The ability to provide nudges and insights for the sales team is one of my favorite features of Aviso. I love being able to verify if a deal has been progressed or not and understand where it stands in terms of progress towards completion.</p><p>Furthermore, Aviso helps managers understand what is happening with their deals. When you start to look at things like deal scoring, it rapidly provides insights into the health of a particular account and suggests key actions for the accounts team in order to help them along their selling journey. So, the better I can help my customers achieve their goals, the more success we will have.</p><p class='uk-h4'>Aviso: How has Aviso’s time-series approach helped tackle problems with data?</p><p><b>Simon Davies:</b> The CRM system is a snapshot in time, and as a sales leader, you need to make sure that it’s current. The ability to use time-series across data to go back and identify what has happened in the past is important for a sales leader. It allows you to see how deals may have failed but also helps you correct any future errors.</p><p>To understand the threat you face, you need time-series data. This is for sales leaders who want their teams to work through cycles quickly and establish value with customers by investing in the stages where there's the highest potential return on investment.</p><p>The power of data is its ability to provide a complete and accurate representation of what's happening. When we see time-series data, such as pipeline movement or go-to-market motions within our product cycles it helps us understand the role each factor played within those events. This leads to an improved understanding of the best way to course-correct any gaps that may exist through further analysis with this newfound insight.</p><p class='uk-h4'>Aviso: As a sales leader, how has your journey with Aviso helped you drive results in digital selling?</p><p><b>Simon Davies:</b> From an end-user point of view, anybody who uses Aviso mentions it with a smile on their face because they feel more successful. As sales leaders, we can add value by listening to our customers and making sure that every resource in this organization is aligned toward achieving customer outcomes. This has been Trevor's mantra ever since he took over as the CEO.</p><p>It's not just about what you know, but how well you do it. This insight is a unique thing that Aviso’s customers can take advantage of and will be able to continue building innovation into their platforms with all this data coming together now in one place.</p><p>Trevor is a walking, talking example of how one might improve the way we think about selling. He's had plenty of experience with different types of organizations and can share his insights to give you an inside look at what works best for them. I've always been really excited to be involved in Aviso and I love seeing the innovation they go through. It's great learning from other sales leaders in this community, looking at their stories, and picking up cool tips on how best to think about pipeline strategy.</p><p class='uk-h4'>Conclusion</p><p>In this interview segment, Simon Davies discusses why certain deals flatline and the various factors that can be optimized to move them forward; and how Nudges from Aviso AI can look at different data points to provide insights directly to the seller. Simon also spoke about how he learns from the sales community about doing things differently when it comes to the pipeline strategy, incentives, territory planning, aligning teams, and coaching conversations.</p><p>Aviso’s AI platform applies time series capabilities and forecasting algorithms to customers’ data to uncover insights they would never have known otherwise, including specific actions to close an important deal. Aviso enables sales managers to utilize specific nudges in their decision-making process to improve their team’s performance and maximize the company's profitability.</p><p>If you are interested in following Splunk's decision to go with Aviso's time series revenue platform, please sign up <a href='/contact'>here</a>. You can also read other customers' success stories <a href='/customers'>here</a>.</p>"
}
