{
	"content": "<span style=\"font-weight: 400\">In a recent edition of Aviso’s</span><b> Revenue Navigators Series</b><span style=\"font-weight: 400\">, we had the opportunity to discuss with </span ><a href=\"https://www.linkedin.com/in/alarun/\" ><span style=\"font-weight: 400\">Al Arun</span></a ><span style=\"font-weight: 400\"> how using revenue-focused Artificial Intelligence and having a centralized approach to revenue operations including those anchored around CRM is transforming the customer adoption process. Arun is the Chief Customer Officer of Ivanti, an IT asset and management software solutions organization. This article is the first segment of four blog posts diving into how Al Arun and his team are using cutting-edge revenue AI solutions to drive the success and growth of Ivanti. In Arun’s interview with Aviso, we learn about his views on the historically frustrating relationship between sales reps and their various CRMs and other sales tools, and ideas on how that can be fixed. </span> <iframe src=\"https://www.youtube.com/embed/3VF5WwF-BSs\" width=\"420\" height=\"315\" ><span data-mce-type=\"bookmark\" style=\" display: inline-block; width: 0px; overflow: hidden; line-height: 0; \" class=\"mce_SELRES_start\" > </span ></iframe > <strong >Aviso: <b >Why don’t salespeople and CRM have a happy relationship as users themselves?</b ></strong > <span style=\"font-weight: 400\" >Salespeople are at the forefront of trying to help customers see, understand the value, and purchase solutions. In the modern era of technology, reps are directly assisted by various CRM tools for sales analytics, deal streamlining, and <a href=\"https://www.aviso.com/blog/revenue-forecasting/\" target=\"_blank\" rel=\"noopener\" >revenue forecasting</a >. However, a significant concern in today’s software space is the rebellion and frustration with salespeople as the direct users of time-consuming CRM tools. Arun explained that </span ><i ><span style=\"font-weight: 400\" >“When that productivity [of sales reps] is taken away, and the goal now becomes to enter data into a system, to put in a forecast number such that management can look at it, this lengthy process ultimately takes time away from customers’ face-time and closing deals”</span ></i ><span style=\"font-weight: 400\"> </span> <span style=\"font-weight: 400\" >Arun has experienced firsthand how traditional single-use CRM systems create difficulty for salespeople handling multiple communication channels and data sources. However, from a leadership and management standpoint, this process is still necessary to forecast accurately and understand the sales trends of a specific quarter. In the world of acquisitions being essential for a company’s growth, there is still a need for CRM numbers to justify an acquired organization’s value. Arun noted this impact as, </span ><i ><span style=\"font-weight: 400\" >“Sales reps that are selling multiple solutions need to be on multiple CRM systems, this can be so time-consuming and counterproductive, and can also make it very confusing for sales reps to understand how and where they need to be spending their time.”</span ></i > <span style=\"font-weight: 400\" >In other words, the relationship is much more one-way than it should be. And who likes one-way relationships?! </span> <iframe src=\"https://www.youtube.com/embed/NaL6pu_A7l0\" width=\"420\" height=\"315\" ><span data-mce-type=\"bookmark\" style=\" display: inline-block; width: 0px; overflow: hidden; line-height: 0; \" class=\"mce_SELRES_start\" > </span ></iframe > <strong >Aviso: <b >What are you most excited as a C-suite customer leader about the role of AI to overcome the limitations of CRM?</b ></strong > <span style=\"font-weight: 400\" >To set sales reps up for success, an organization needs to give them ample time to be face-to-face with customers. The other mundane processes, such as entering data and making forecasts, need to be effective and efficient. Arun talked about the many ways that Revenue AI is shaping the sales process by “</span ><i ><span style=\"font-weight: 400\" >Looking at trends that happen in certain product lines within a company on the sales cycle, recognizing what the behavior of sales reps are in changing opportunity stages, being able to identify where there might be similar deals or customers, or being able to create deal rooms for collaboration,”</span ></i ><span style=\"font-weight: 400\"> and how </span ><i ><span style=\"font-weight: 400\" >“These are just a sprinkling of some of the ways by which AI can help.” </span ></i > <span style=\"font-weight: 400\" >Arun further explained how there are endless methods of communication and ways of interaction with customers in today’s day and age. Tracking customer data becomes complicated and time-consuming with all of these different engagement channels. With a system that can gather relevant information and then make the necessary analysis and insights, AI makes a sellers’ life more manageable and allows sales reps to focus on what is essential: making the sales number. </span > <span style=\"font-weight: 400\" >In other words, the application of AI to sales data and the customer engagement process presents reps and teams a fresh opportunity to fix the CRM relationship problem! </span> <iframe src=\"https://www.youtube.com/embed/adt5wAMInzc\" width=\"420\" height=\"315\" ><span data-mce-type=\"bookmark\" style=\" display: inline-block; width: 0px; overflow: hidden; line-height: 0; \" class=\"mce_SELRES_start\" > </span ><span data-mce-type=\"bookmark\" style=\" display: inline-block; width: 0px; overflow: hidden; line-height: 0; \" class=\"mce_SELRES_start\" > </span ></iframe > <b >Aviso: Al, so how can a company start right with a single pane of glass quickly for revenue operations?</b > <span style=\"font-weight: 400\" >Every company in the technology ecosystem is struggling to establish a “single pane of glass” effectively. With many companies needing to justify acquisitions and demonstrate their growth to investors, it is necessary to have a CRM solution with a centralized architecture that provides immediate results from many disparate data resources. Arun pointed out that </span ><i ><span style=\"font-weight: 400\" >“Now sales reps, whether they are in one CRM system or five CRM systems, can be in a single pane of glass where they can recognize where there are different deals being worked on with the same customer, without waiting for the heavy lifting of getting all of the customer data consolidated.” </span></i ><span style=\"font-weight: 400\" >Without the tedious data input and integration process, sales reps can make decisions that allow for quick collaboration across different company units, resulting in bigger deals and higher revenues. </span > <span style=\"font-weight: 400\" >In other words: You need a single pane of glass across your CRM and other sales tools! </span> <span style=\"font-weight: 400\" >Sales reps need to help customers find and sell product solutions and adapt in real-time to customers who buy digitally and are more informed than ever before. At the same time, it is important to accurately and efficiently predict forecasted sales without entering massive amounts of customer data for forecasting tools. Handling multiple CRM systems is time-consuming and confusing, emphasizing the need for sales reps to have a single platform to streamline sales decisions. As discussed with Al, the solution is a single pane of glass that uses AI to quickly give sales reps and revenue leadership insights into making effective decisions. </span> <span style=\"font-weight: 400\" >In Arun’s next Revenue Navigator blog post, we discuss how and where companies can find a single pane of glass platform to drive all revenue operations. </span> <span style=\"font-weight: 400\" >If you are interested in following Ivanti’s decision to go with Aviso’s single pane of glass, please <a href=\"https://www.aviso.com/contact-us/?utm_source=AlArunBlogCTA&amp;utm_medium=blog&amp;utm_campaign=OwnBlog\" >sign up here</a >. You can also read other customers' success stories </span ><span style=\"font-weight: 400\" ><a href=\"https://www.aviso.com/resources/?utm_source=AlArunBlogCTA&amp;utm_medium=blog&amp;utm_campaign=OwnBlog\" >here</a >.</span > "
}
