{
	"title": "Top 5 Risks of Using Spreadsheet Forecasts",

	"content": "Spreadsheet blunders have cost companies millions. Studies have shown that <span style=\"color: #b32e61;\"><a style=\"color: #b32e61;\" href=\"http://panko.shidler.hawaii.edu/SSR/Mypapers/whatknow.htm\">90% of spreadsheets contain errors</a>.</span> Clearly, spreadsheet forecasts can't possibly be reliable -- so why are so many B2B tech companies still relying on a clunky combination of CRM reports and spreadsheets to produce their forecasts?\n\nSales forecasting is one of the single most important processes at any B2B company. The number that the sales team delivers drives a series of other critical processes -- from resource allocation, inventory planning, attracting investors, to reporting out to the street. Yet, companies still rely on largely outdated tools, which can pose great risks.\n\nHere are the top five dangers of using spreadsheet forecasts to drive your revenue strategy.\n<h4><strong>1. Human Bias in Spreadsheet Forecasts Can Easily Introduce Million Dollar Data Entry Errors that Compromise Accuracy.</strong></h4>\nAs your organization grows, spreadsheets naturally become more complex. Over time, formula and data entry errors will inevitably creep into your spreadsheets, which severely and materially impact forecast accuracy.\n\nTogether, accounting for spilt deals, currency conversions, and sales crediting issues makes data entry mistakes common.\n\nAdditionally, errors will creep into the spreadsheet as the sales organization changes. Spreadsheets are often designed to handle a specific organizational rollup. But sales reps churn, and new reps and overlays are added.\n\nMatrix organizations become common, and spreadsheets are slow to adapt. This results in duplicate deals or numbers, which can easily ruin the integrity of your data. As staff turns over, spreadsheet maintenance becomes increasingly difficult.\n\n<strong>The result:</strong>\nIt’s happened to all of us -- it only takes one formula or data entry error to completely throw off your entire spreadsheet forecast and erode the credibility of your sales and sales ops team.\n<h4><strong>2. Forecast Numbers Constantly Change, Making Spreadsheets Quickly out of Date, and Leading to Arguments Over the Data. </strong></h4>\nMore often than not, the latest data entered into CRM is not reflected in your spreadsheets. We estimate that 99% of the time, these two tools are out of sync.\n\nWe understand that businesses use spreadsheet forecasts to augment their CRM data. Most CRM systems lack strong forecasting modules. Alone, they can only leverage single point in time data and are unable to employ multiple forecast views across different business pivots, as is needed for 360 degree visibility.\n\n<strong>The result:</strong>\nSpreadsheets are generally updated once per week with data from CRM systems, so the minute reps change a deal status or forecast, the spreadsheet becomes out-of-date. Since spreadsheets often contain stale data, this leads to a lot of time wasted arguing over numbers, and takes time away from coaching and more strategic deal-level discussion.\n<h4><strong>3. Sales Ops Wastes Hours Per Week Working on Spreadsheets Rather than More Strategic Activities.</strong></h4>\nA vast amount of time is spent collating, maintaining, and verifying data in spreadsheets. Excel spreadsheets were not designed to do large collaborative projects, so typically sales operations will build multiple spreadsheets that are then distributed, copied, and used. Here's the problem: version control can become a big issue. Sales ops must distribute, then collate, check and often re-enter information into a master spreadsheet that becomes the official forecast.\n\nIn organizations with multiple levels, the problem is amplified. Each level of the organization adds their own judgment to the forecast, and Sales Operations must repeat the process of re-collating, re-checking and re-entering data in multiple master spreadsheets to inform their forecasts.\n\n<strong>The result:</strong>\nSales Operations is faced with the unenviable task of accurately rolling up an accurate spreadsheet forecast in a short period of time with a system that is inherently unstable. Your team ends up wasting time that could otherwise be spent on more strategic activities such as pipeline and territory reviews.\n<h4><strong>4. Spreadsheet Forecasts Provide Very Limited Visibility into Revenue, and Fail to Help You Answer Basic Sales Questions.</strong></h4>\nIn the hybrid CRM and spreadsheet combination, the CRM holds detailed data on deals and pipelines, while the spreadsheet forecast holds prediction summaries and historical information. Since the two systems are not synced, you cannot drill down into the forecast to see what deals make up the forecast. This process is further complicated by the judgment added by each level of sales management.\n\n<strong>The result:</strong>\n\nYou’re unable to see which deals are impacting your forecast. You can’t see judgment applied across the hierarchy. Answering routine and frequently asked questions is next to impossible. How do you know if a deal is in or out of the forecast? What changed between forecasts? Most importantly, why?\n\nUltimately, spreadsheet forecasts cannot provide you with the visibility you need to run your business or the forecast call.\n<h4><strong>5. Spreadsheet Forecasts Cannot Offer Predictive Insight.</strong></h4>\nLeading sales organizations now leverage big data and AI for predictive forecasting, but the existing CRM/ spreadsheet system lacks meaningfulpredictive insight. Spreadsheet forecasts can contain only summary-level information and CRM systems keep limited historical data that machine learning algorithms would need to make AI-based predictions.\n\n<strong style=\"font-size: 1em;\">The result:</strong><span style=\"font-size: 1em;\">\n</span>You’re unable to leverage your historical data to gain insights into how your quarter will unfold or see an objective AI forecast for comparison against your team's predictions.\n\nForecasting must be modernized. Using single-point CRM reports and outdated spreadsheets cannot be the future. Early adopters such as <span style=\"color: #b32e61;\"><a style=\"color: #b32e61;\" href=\"https://www.aviso.com/customers/\">Xactly, Splunk and Apttus</a></span> have moved to a cloud-based forecasting tool, which delivers the following benefits:\n<ul>\n \t<li><span style=\"font-size: 1em; text-indent: -1.5em;\">Automates the rollup to eliminate spreadsheets and the errors that come along with them</span></li>\n \t<li><span style=\"font-size: 1em; text-indent: -1.5em;\">Enables multiple forecast views with the click of a button, giving you a 360-degree view</span></li>\n \t<li><span style=\"font-size: 1em; text-indent: -1.5em;\">Has a deal-level forecasting feature that shows which deals are in and out of forecast</span></li>\n \t<li><span style=\"font-size: 1em; text-indent: -1.5em;\">Provides the ability to drill down into the deals making up your forecasts</span></li>\n \t<li><span style=\"font-size: 1em; text-indent: -1.5em;\">Provides visibility into deal-level detail and judgment applied across every level of the organization</span></li>\n \t<li><span style=\"font-size: 1em; text-indent: -1.5em;\">Keeps a complete history of every deal, pipeline, and forecast so that machine learning models can be used to do predictive forecasting\n</span></li>\n \t<li>Syncs with your CRM for real-time data that is always up-to-date<span style=\"font-size: 1em; font-weight: 600; text-indent: -1.5em;\">\n</span></li>\n \t<li>And more.</li>\n</ul>\nYou deserve better than high-risk, low-reward spreadsheet forecasts.  See how 98% accurate, AI-powered forecasting can help your business scale.\n<p style=\"text-align: center;\">[button link=\"#https://www.aviso.com/contact-us/\" type=\"big\" color=\"red\" newwindow=\"yes\"] <span style=\"color: #ffffff;\"><b>Schedule a Demo </b></span>[/button]</p>\n&nbsp;\n\n&nbsp;\n\n&nbsp;\n\n&nbsp;",
	"slug": "spreadsheet-forecasts",
	"author": "Editor",
	"categories": ["Sales Forecasting"],
	"pub_date": "9/14/17",
	"pub_time": "1:37 AM",
	"description": "Spreadsheet forecasting can help augment your CRM. However, when it comes to predicting revenue, the use of spreadsheets is high-risk and low reward."
}
