{
	"title": "What is NoCRM?",

	"content": "Customer relationships are at the heart of the sales process. In 2020, 74% of all companies report using CRM software, with adoption helping increase sales by up to 29%, productivity by up to 34%, and <span style=\"color: #b03367;\"><a style=\"color: #b03367;\" href=\"https://www.nutshell.com/blog/crm-stats/\" target=\"_blank\" rel=\"noopener nofollow\">forecast accuracy by 42%</a></span>. So what's the deal with <strong>NoCRM?</strong> What does NoCRM mean in theory and in practice? And what can it mean to you if you live and breathe the world of sales and revenue?\n\nLet's start by taking a step back.\n<h2><strong>A Brief Look Back In Time</strong></h2>\nThe CRM industry started in the early 1980s. If it were an adult it would be a part of Gen X, between baby boomers and millenials.\n\nSince the first CRM launched, a lot has happened in terms of technological advancement. We went from cassette tapes and DVDs to Netflix and Youtube. We went from taxis to Uber to peak Uber, from IRC Chat to Yahoo Messenger to WhatsApp. The technologies in our personal life make life easy and allow us to do more with less.\n\nIn theory, that was the promise of CRM. CRM was meant to be easy to use.\n\nIn reality, while CRM helped millions of businesses embrace the cloud, it has also created a false equivalence between data capture and sales performance.\n\n<strong>It demands more from reps than it gives.</strong>\n\nWhile the number of CRM systems has exponentially increased (there are 379 CRMs on G2 Crowd and counting) ROI outcomes have remained below par:\n<ul>\n \t<li>Less than 30% of CRM projects succeed per <span style=\"color: #b03367;\"><a style=\"color: #b03367;\" href=\"https://hbr.org/2018/12/why-crm-projects-fail-and-how-to-make-them-more-successful\" target=\"_blank\" rel=\"noopener nofollow\">Harvard Business Review</a></span></li>\n \t<li>66% of sales reps’ time is wasted on non-selling activities per <span style=\"color: #b03367;\"><a style=\"color: #b03367;\" href=\"https://technologyadvice.com/blog/sales/2018-state-sales-report/\" target=\"_blank\" rel=\"noopener nofollow\">Salesforce Reports</a></span></li>\n \t<li>CRM adoption refuses to budge beyond 15-20% per <span style=\"color: #b03367;\"><a style=\"color: #b03367;\" href=\"https://www.csoinsights.com/wp-content/uploads/sites/5/2016/08/2016-Sales-Performance-Optimization-Study-Key-Trends-Analysis.pdf\" target=\"_blank\" rel=\"noopener nofollow\">CSO Insights</a></span></li>\n</ul>\n<h2><strong>The Problem with CRM Today</strong></h2>\nWait a minute, you might say…Wasn’t CRM going to be the shiny bellwether for enterprise software and for the future of work? And since CRM has grown from a $10B to $120B industry, rep quota attainment must have gone up too, right?\n\nNo! It has fallen to an <a href=\"https://blog.stormventures.com/aviso-a-nocrm-approach-to-sales-1710dbc224fb\" target=\"_blank\" rel=\"noopener nofollow\"><span style=\"color: #b03367;\">all-time low of 43%</span></a> in 2018, down from 66% in 2011.\n\nIf it continues down this path, CRM spending will be up to <strong>$1.2 trillion</strong>, and attainment will drop to <strong>less than 20%</strong> in the next 10 years. There is no positive correlation between rep attainment and CRM spending. (In fact, the correlation might even be negative.)\n\n<img class=\"aligncenter wp-image-7951 size-full\" src=\"https://assets.uiaas.io/web/aviso/blog/State-of-revenue-performance.webp\" alt=\"The state of revenue performance. Charts of outcome of forecasted opportunities and percentage of reps achieving quota.\" width=\"616\" height=\"318\" />\n\n&nbsp;\n<h4>In theory, CRM started off as a way to help reps.</h4>\nThe idea was that if reps fill in their fields, enter in their next-steps, and stay on top of appointments, then they were much more likely to close more deals.\n<h4>In practice, more and more people wanted information out of CRM as time progressed.</h4>\nLegal, Procurement, Marketing, requested that more fields be added and kept updated. This wound up putting more administrative burden on sales reps.\n<p style=\"text-align: left;\">Over time, CRM has become a huge, lumbering database. It is a beast constantly hungry for more fields, events, and time spent with very little return.</p>\n\n<h2><strong>Sailing Beyond CRM</strong></h2>\nSales technology cannot continue down this path if it has to help reps and teams succeed. <strong>That’s where NoCRM comes in.</strong>\n<blockquote>“NoCRM” is a call to break free from the shackles of the CRM product experience. “NoCRM” is a better reality where reps focus on deal guidance, instead of spending their afternoons on data fluffing. “NoCRM” is a brave new world of the modern, AI-powered salesperson and GTM teams of the future.</blockquote>\nSo what does “NoCRM” look like? Are we suggesting that GTM teams go back to the dark ages and run their businesses out of Excel? No, of course not!\n\nRather, we need focus. We need guidance. We need the technology of the future to be the foundation of a sales organization.\n\nWith that, AI is the secret sauce <strong>that makes NoCRM possible</strong>. With AI augmentation, you can manage and run your sales organization in a completely new way, with real results.\n\n<img class=\"aligncenter wp-image-7952\" style=\"font-size: 0.875em;\" src=\"https://assets.uiaas.io/web/aviso/blog/crmvsnocrm.webp\" alt=\"Chart of CRM versus noCRM.\" width=\"615\" height=\"315\" />\n<h2><strong>NoCRM with LessIsMore</strong></h2>\nImagine if you could use AI to augment your reps and GTM teams <strong>to do more with less</strong>. That’s a philosophy that we at Aviso call #LessIsMore -- where teams use the power of leverage to win more deals by working smarter, not harder.\n\nImagine if there was a way <a href=\"https://www.aviso.com/pipeline-acceleration/\">to <span style=\"color: #b03367;\">know the “golden” fields in your CRM database</span></a> that progress deals and are the key predictors of deal health. Imagine if those were the only fields your reps had to update, instead of a mind-numbing aggregate of contact information and interactions.\n\nImagine if reps could get<span style=\"color: #b03367;\"><a style=\"color: #b03367;\" href=\"https://www.aviso.com/blog/new-product-update-nudges/\"> recommended insights and actions</a></span> as mobile, course-correcting “nudges” in the same way that your Apple Watch nudges you to get your heart rate in the safe zone.\n\nImagine if managers, CFOs and CROs could blend the best of both human intuition and AI judgment to <span style=\"color: #b03367;\"><a style=\"color: #b03367;\" href=\"https://www.aviso.com/conversational-intelligence/\">unify their forecasting and deal execution</a></span> in AI-powered collaboration rooms. (P.S. <span style=\"color: #b03367;\"><a style=\"color: #b03367;\" href=\"https://journals.sagepub.com/doi/10.1177/0022242920956676\">Research</a> </span>shows that the combination of AI and human judgment outperforms either AI or human ability alone!)\n\nThat’s what <strong>NoCRM, AI-based guided selling</strong> can do for your team, while also improving win-scores and driving top-line revenue.\n\n<img class=\"alignright wp-image-7975\" style=\"color: #456381;\" src=\"https://assets.uiaas.io/web/aviso/blog/noCRM-product-screens-e1570564501235.webp\" alt=\"Images of noCRM implemented across different devices.\" width=\"1051\" height=\"290\" />\n\n&nbsp;\n\nIn practice, here’s what it means for <span style=\"color: #b03367;\"><a style=\"color: #b03367;\" href=\"https://www.aviso.com/revenueteamroles/\">each different role</a></span>:\n<ul>\n \t<li><strong>For Reps:</strong> Guidance, Deal Focus, Hygiene, Deals at Risk, Upside, Pull-ins, Nudges, Deal rooms.</li>\n \t<li><strong>For Managers:</strong> Coaching, Deals at Risk, Upside Deals, Pull-Ins, Roll-Ups.</li>\n \t<li><strong>For Sales Ops:</strong> Forecasting Accuracy with Insights, Deals at Risk.</li>\n \t<li><strong>For CROs:</strong> Digests (Visibility, Pacing, Top Deals at Risk, Top Upside Deals), Cost Takeout.</li>\n</ul>\nLearn more about how you can <span style=\"color: #b03367;\"><a style=\"color: #b03367;\" href=\"https://www.aviso.com/\">be a part of this transformation</a></span> with Aviso.\n\n&nbsp;",
	"slug": "what-is-nocrm",
	"author": "Neha Nirkondar",
	"categories": ["AI for Sales"],
	"pub_date": "10/8/19",
	"pub_time": "9:26 AM",
	"description": "What's the deal with NoCRM? Here's the thing: CRM started off as a way to help reps. In reality, it's a beast, hungry for endless fields and time spent."
}
